Repository: johntseng/webonary
Catalog: wp-resources/plugins/sil-dictionary-webonary/include/lang/sil_dictionary-*.po
Languages: ur_pk

source: Physical actions
ur_pk: طبعی عمل

source: Posture
ur_pk: چال ڈھال/ اعضاء جسمانی کی ظاہری کیفیت

source: Stand
ur_pk: کھڑا ہوا

source: Sit
ur_pk: بیٹھنا

source: Lie down
ur_pk: لیٹنا

source: Kneel
ur_pk: گھٹنوں کے بل بیٹھنا

source: Bow
ur_pk: سر جُھکانا، سر خم کرنا، آداب بجا لانا

source: Lean
ur_pk: جُھکنا، ترچھا ہونا

source: Straight posture
ur_pk: سیدھے وضع قصع

source: Relaxed posture
ur_pk: ڈھیلا انداز،ڈھیلا طرز

source: Bend down
ur_pk: نیچے کو خم ہونا

source: Move a part of the body
ur_pk: جسم کے کسی ایک حصے کی حرکت

source: Move
ur_pk: حرکت

source: Manner of movement
ur_pk: طرز یا ڈھب ِ حرکت

source: Walk
ur_pk: چلنا

source: Run
ur_pk: دوڑنا

source: Crawl
ur_pk: رینگنا

source: Jump
ur_pk: چھلانگ

source: Move quickly
ur_pk: جلدی حرکت

source: Move slowly
ur_pk: آہستہ حرکت

source: Wander
ur_pk: گھومنا

source: Graceful
ur_pk: محتاط

source: Clumsy
ur_pk: بے ڈھنگا

source: Walk with difficulty
ur_pk: مشکل سے چلنا

source: Slip, slide
ur_pk: سرک جانا، پھسلنا

source: Steady, unsteady
ur_pk: ثابت قدم،قاہم مزاج، میانہ رویکسان طور پر–جس کا مزاج ایک جیسا نہ ہو،

source: Balance
ur_pk: توازن

source: Move noisily
ur_pk: شور مچاتے ہوئے حرکت کرنا

source: Move in a direction
ur_pk: کسی طرف حرکت کرنا

source: Move forward
ur_pk: آگے حرکت کرنا

source: Move back
ur_pk: پیچھے مڑنا یا حرکت کرنا

source: Move sideways
ur_pk: ایک طرف کو مڑنا

source: Move up
ur_pk: اوپر کو حرکت کرنا

source: Move down
ur_pk: نیچے کو ہونا یا حرکت کرنا

source: Fall
ur_pk: گرنا

source: Turn
ur_pk: مڑنا

source: Move in a circle
ur_pk: دائرے میں حرکت کرنا

source: Move back and forth
ur_pk: آگے پیچھے حرکت کرنا

source: Move straight without turning
ur_pk: موڑنے کی بجائے سیدھی حرکت کرنا

source: Move toward something
ur_pk: کسی چیز کی طرف حرکت کرنا

source: Move away
ur_pk: دور جانا،

source: Go
ur_pk: جانا

source: Come
ur_pk: آنا

source: Leave
ur_pk: چھوڑنا

source: Arrive
ur_pk: آنا

source: Move in
ur_pk: اندر کو ہونا

source: Move out
ur_pk: باہر کو ہونا یا جانا

source: Move past, over, through
ur_pk: کسی کوچھوڑنا، اوپر سے ہونا یا کسی چیز میں سے گزرنا

source: Return
ur_pk: واپس

source: Travel
ur_pk: سفر کرنا

source: Travel by land
ur_pk: بری سفر

source: Vehicle
ur_pk: گاڑی

source: Railroad
ur_pk: ریل کی

source: Travel by water
ur_pk: بحری سفر

source: Boat
ur_pk: کشتی

source: Swim
ur_pk: تیرنا

source: Dive
ur_pk: غوطہ لگانا

source: Fly
ur_pk: اڑنا

source: Travel in space
ur_pk: خلائی سفر کرنا

source: Move to a new house
ur_pk: نئے گھر میں جانا

source: Way, route
ur_pk: راستہ

source: Lose your way
ur_pk: راستہ بھول جانا

source: Map
ur_pk: نقشہ

source: Accompany
ur_pk: ساتھ دینا، یا ساتھ ہونا یا ساتھ سفر کرنا

source: Go first
ur_pk: پہلے جانا

source: Follow
ur_pk: پیروی کرنا

source: Guide
ur_pk: رہنمائی کرنا

source: Move together
ur_pk: ایک ساتھ حرکت کرنا

source: Pursue
ur_pk: تعاقب کرنا

source: Catch, capture
ur_pk: پکڑنا

source: Prevent from moving
ur_pk: حرکت سے روکنا

source: Escape
ur_pk: بھاگنا

source: Set free
ur_pk: آزاد کرنا

source: Not moving
ur_pk: حرکت نہ کرنا

source: Stop moving
ur_pk: حرکت کرنے سے رُکنا

source: Stay, remain
ur_pk: رُکنا، ٹھرے رہنا

source: Wait
ur_pk: انتظار

source: Send someone
ur_pk: کسی کو بھیجنا

source: Move something
ur_pk: کسی چیز کا حرکت کرنا

source: Carry
ur_pk: اُٹھانا

source: Throw
ur_pk: پھینکنا

source: Catch
ur_pk: پکڑنا

source: Shake
ur_pk: ملانا، ہلانا

source: Knock over
ur_pk: اوندھ جانا/ گر جانا

source: Set upright
ur_pk: اپنی جگہ رکھنا

source: Move something in a direction
ur_pk: کسی چیز کا سمت میں حرکت کرنا

source: Put in front
ur_pk: سامنے رکھنا

source: Put in back
ur_pk: پس پُشت ڈالنا

source: Put aside
ur_pk: ایک طرف رکھنا

source: Lift
ur_pk: اُٹھانا

source: Hang
ur_pk: لٹکنا یا لٹکانا

source: Lower something
ur_pk: زیر کرنا، یا نیچے کرنا

source: Put in
ur_pk: ڈالنا

source: Take something out of something
ur_pk: کسی چیز کو باہر نکالنا

source: Pull
ur_pk: کھنچنا

source: Push
ur_pk: دھکیلنا

source: Take somewhere
ur_pk: کہیں لے جانا

source: Take something from somewhere
ur_pk: کسی جگہ سے کسی کو لے جانا

source: Return something
ur_pk: کسی چیز کی واپسی کرنا

source: Send
ur_pk: بھیجنا

source: Chase away
ur_pk: بدر کرنا

source: Drive along
ur_pk: کسی کو ساتھ لے جانا

source: Handle something
ur_pk: کسی چیز کا بندوبست کرنا یا انتظام کرنا

source: Touch
ur_pk: چھونا

source: Pick up
ur_pk: اٹھانا

source: Put down
ur_pk: نیچے چھوڑنا

source: Hold
ur_pk: پکڑنا

source: Actions of the hand
ur_pk: ہاتھوں کے عوامل

source: Support
ur_pk: تھامنا اُٹھانا،سہارا دینا

source: Extend
ur_pk: بڑھانا،پھیلانا، لمبا کرنا

source: Turn something
ur_pk: کسی چیز کا موڑنا

source: Open
ur_pk: کُھلنا

source: Shut, close
ur_pk: بند کرنا

source: Block, dam up
ur_pk: روکنا، انسداد کرنا،روک

source: Limit
ur_pk: حد

source: Cover
ur_pk: ڈھانپنا، ڈھکنا، چھپا دینا

source: Uncover
ur_pk: سرپوش الگ کرنا، کھولنا

source: Wrap
ur_pk: لپیٹنا

source: Spread, smear
ur_pk: پھیلانا

source: Transport
ur_pk: مال بردار

source: Have, be with
ur_pk: کسی چیز کا ہونا

source: Give, hand to
ur_pk: دینا

source: Receive
ur_pk: حاصل کرنا

source: Get
ur_pk: حاصل کرنا/ پانا

source: Distribute
ur_pk: تقسیم کرنا

source: Keep something
ur_pk: کسی چیز کا رکھنا

source: Leave something
ur_pk: کسی چیز کو چھوڑنا یا تَرک کرنا

source: Throw away
ur_pk: پرے پھینکنا

source: Not have
ur_pk: نہ ہونا

source: Arrange
ur_pk: انتظام/ترتیب

source: Gather
ur_pk: اکھٹا ہونا

source: Separate, scatter
ur_pk: علیہدہ کرنا، پھیلانا

source: Include
ur_pk: شامل کرنا

source: Special
ur_pk: خاص

source: Join, attach
ur_pk: ملانا

source: Link, connect
ur_pk: ملانا

source: Stick together
ur_pk: ایک دوسرے سے چھپک جانا

source: Add to something
ur_pk: کسی چیز کا اضافہ کرنا

source: Remove, take apart
ur_pk: ہٹانا

source: Mix
ur_pk: اکھٹنا ہونا یا کرنا

source: Pure, unmixed
ur_pk: خالص

source: Tie
ur_pk: باندھنا

source: Rope, string
ur_pk: رسی،رسہ

source: Tangle
ur_pk: الجھنا، پھنسانا

source: Organize
ur_pk: ترتیب دینا

source: Disorganized
ur_pk: بے ترتیب

source: Substitute
ur_pk: نیمُ لبدل

source: Multiple things moving
ur_pk: کئی چیزوں کی حرکت

source: Simple, complicated
ur_pk: سادہ / مشکل

source: Put
ur_pk: رکھنا

source: Load, pile
ur_pk: لادنا

source: Fill, cover
ur_pk: بھرنا

source: Hide
ur_pk: چھپانا

source: Search
ur_pk: تلاش کرنا

source: Find
ur_pk: ڈھونڈنا

source: Lose, misplace
ur_pk: کھونا

source: Physical impact
ur_pk: جسمانی دباؤ،جکڑنا،تصادم

source: Hit
ur_pk: مارنا/لگنا

source: Aim at a target
ur_pk: نشانہ باندھنا

source: Kick
ur_pk: ٹھوکر مارنا، لات مارنا

source: Press
ur_pk: دبانا

source: Rub
ur_pk: رگڑنا

source: Grind
ur_pk: پیسنا

source: Mark
ur_pk: نشان لگانا

source: Divide into pieces
ur_pk: ٹکڑوں میں تقسیم کرنا

source: Break
ur_pk: توڑنا

source: Crack
ur_pk: چیر

source: Cut
ur_pk: کاٹنا

source: Tear, rip
ur_pk: چیرنا، پھاڑنا

source: Make hole, opening
ur_pk: کھولنا، سوراخ کرنا

source: Dig
ur_pk: کھودنا

source: Break, wear out
ur_pk: توڑنا / ٹوٹنا

source: Damage
ur_pk: نقصان پہنچانا، ضرر پہنچانا

source: Tear down
ur_pk: پھاڑنا

source: Destroy
ur_pk: تباہ کرنا / برباد کرنا

source: Repair
ur_pk: مرمت کرنا

source: States
ur_pk: حالت

source: Quantity
ur_pk: مقدار

source: Number
ur_pk: تعداد

source: One
ur_pk: ایک

source: Two
ur_pk: دو

source: Number of times
ur_pk: وقت کی تعداد

source: Multiples
ur_pk: بکثرت، ایسا عدد جو دوسرے پر پورا پورا تقسیم ہو سکے

source: Numbered group
ur_pk: گروہی مقدار

source: Fraction
ur_pk: کسر

source: Number series
ur_pk: ہندسی سلسلہ

source: Count
ur_pk: گِننا

source: Mathematics
ur_pk: حساب

source: Add numbers
ur_pk: اعداد کو جمع کرنا

source: Subtract numbers
ur_pk: اعداد کو منفی/ تفریق کرنا

source: Multiply numbers
ur_pk: اعداد کو ضرب دینا

source: Divide numbers
ur_pk: اعداد کو تقسیم کرنا

source: Plural
ur_pk: جمع

source: Many, much
ur_pk: کئی/ ذیادہ

source: Few, little
ur_pk: چند/ کم

source: Group of things
ur_pk: چیزوں کا گروہ

source: More
ur_pk: کئی

source: Less
ur_pk: کم

source: Increase
ur_pk: اضافہ

source: Decrease
ur_pk: کمی

source: All
ur_pk: تمام

source: Some
ur_pk: کچھ

source: None, nothing
ur_pk: کچھ بھی نیہں

source: Both
ur_pk: دونوں میں

source: Most, almost all
ur_pk: اکثر

source: Most, least
ur_pk: اکثر

source: Almost
ur_pk: اکثر

source: Only
ur_pk: صرف

source: Exact
ur_pk: ٹھیک / صحیح

source: Approximate
ur_pk: اندازتا

source: Average
ur_pk: اوسط

source: Whole, complete
ur_pk: مکمل/ تمام

source: Part
ur_pk: حصہ

source: Piece
ur_pk: ٹکڑا/ حصہ

source: Enough
ur_pk: کافی

source: Extra
ur_pk: اضافی

source: Lack
ur_pk: کمی

source: Need
ur_pk: ضرورت

source: Remain, remainder
ur_pk: باقی ماندہ

source: Full
ur_pk: بھرا ہوا

source: Empty
ur_pk: خالی

source: Big
ur_pk: بڑا

source: Small
ur_pk: چھوٹا

source: Long
ur_pk: لمبا

source: Short, not long
ur_pk: چھوٹا

source: Tall
ur_pk: لمبا

source: Short, not tall
ur_pk: چھوٹا

source: Thick
ur_pk: موٹا

source: Thin thing
ur_pk: پتلی چیز

source: Fat person
ur_pk: موٹا آدمی

source: Thin person
ur_pk: پتلا آدمی

source: Wide
ur_pk: کُھلا، چوڑا

source: Narrow
ur_pk: تنگ، بند

source: Big area
ur_pk: بڑا علاقہ

source: Big container, volume
ur_pk: بڑا برتن

source: Distance
ur_pk: فاصلہ

source: Far
ur_pk: دور

source: Near
ur_pk: نزدیک

source: High
ur_pk: اونچا

source: Low
ur_pk: نیچا یا گٹھیا

source: Deep, shallow
ur_pk: گہرہ

source: Fit, size
ur_pk: موزون

source: Tight
ur_pk: کسا ہوا/ جکڑا ہوا

source: Loose
ur_pk: ڈھیلا

source: Wedged in, stuck
ur_pk: کوٹا ہوا، یا پھنسا ہوا

source: Measure
ur_pk: پیمائش

source: Weigh
ur_pk: وزن

source: Heavy
ur_pk: بھاری

source: Light in weight
ur_pk: وزن میں ہلکا

source: Quality
ur_pk: اچھائی ،خصوصیت،خاصییت

source: Shape
ur_pk: شکل

source: Point, dot
ur_pk: نقطہ

source: Line
ur_pk: لائن

source: Straight
ur_pk: سیدھا

source: Flat
ur_pk: ہموار

source: Horizontal
ur_pk: اُفقی

source: Vertical
ur_pk: عمودی

source: Leaning, sloping
ur_pk: جھکاو، نیچے گرنا

source: Bend
ur_pk: ٹیڑھا

source: Roll up
ur_pk: لپیٹنا

source: Twist, wring
ur_pk: مروڑنا، امیٹھ کر پانی ڈالنا

source: Fold
ur_pk: لپیٹنا/ تہ کرنا

source: Round
ur_pk: گول کرنا

source: Concave
ur_pk: گہرا/ محدث

source: Convex
ur_pk: ابھرا/محدب

source: Hollow
ur_pk: کھوکھلا

source: Square
ur_pk: چوکور

source: Pattern, design
ur_pk: نمونہ/ڈیزئن

source: Symmetrical
ur_pk: موزونیت والا

source: Stretch
ur_pk: پھیلانا، کھینچنا، ضرورت سے زیادہ کام کرنا

source: Texture
ur_pk: تار پود، بناوٹ

source: Smooth
ur_pk: نرم

source: Rough
ur_pk: کھردرا

source: Sharp
ur_pk: تیز

source: Pointed
ur_pk: نوکدار، نوکیلا،تیز

source: Blunt
ur_pk: سخت گو، ناتیز

source: Furrow
ur_pk: لکیر، نالی، نالیاں بنانا، ہل چلانا

source: Light
ur_pk: ہلکا یا روشنی

source: Shine
ur_pk: چمک

source: Light source
ur_pk: روشنی کامنبع

source: Bright
ur_pk: روشن

source: Dark
ur_pk: اندھیرا

source: Shadow
ur_pk: سایہ

source: Color
ur_pk: رنگ

source: White
ur_pk: سفید

source: Black
ur_pk: کالا

source: Gray
ur_pk: خاکستری، بھورا

source: Colors of the spectrum
ur_pk: کہکشاں کے رنگ

source: Animal color, marking
ur_pk: جانوروں کے رنگ

source: Change color
ur_pk: رنگ بدلنا

source: Multicolored
ur_pk: کئی رنگ

source: Shiny
ur_pk: چمکیلے

source: Hot
ur_pk: گرم

source: Cold
ur_pk: ٹھنڈا

source: Type, kind
ur_pk: قسم

source: Nature, character
ur_pk: قدرت، کردار

source: Compare
ur_pk: موازنہ کرنا

source: Same
ur_pk: وہی، ایک طرح کا

source: Like, similar
ur_pk: ایک جیسے

source: Different
ur_pk: مختلف

source: Other
ur_pk: دوسرے

source: Various
ur_pk: مختلف

source: Opposite
ur_pk: مخالف

source: Common
ur_pk: مشترک

source: Usual
ur_pk: عام

source: Unusual
ur_pk: غیر عمومی

source: Unique
ur_pk: منفرد

source: Strange
ur_pk: عجیب

source: Pattern, model
ur_pk: نمونہ، ماڈل

source: Imitate
ur_pk: نقل کرنا

source: Copy
ur_pk: نقل کرنا

source: Strong, brittle
ur_pk: مضبوط–خُشک خستہ، ٹوٹ جانے والا

source: Hard, firm
ur_pk: سخت

source: Stiff, flexible
ur_pk: غیر متعیر پذیر/لچک دار

source: Dense
ur_pk: گنجان

source: Soft, flimsy
ur_pk: مالاہم، آسانی سے ٹوٹنے کے قابل

source: Good
ur_pk: اچھا

source: Bad
ur_pk: برا

source: Better
ur_pk: بہتر

source: Worse
ur_pk: بد تر

source: Perfect
ur_pk: صحیح

source: Mediocre
ur_pk: نہ اچھا نہ بُرا، درمیانہ درجہ کا

source: Important
ur_pk: اہم

source: Basic
ur_pk: بنیادی

source: Improve
ur_pk: سدھارنا، بہترکرنا، اصلاح کرنا

source: Right, proper
ur_pk: صحیح، حقیقی

source: Wrong, unsuitable
ur_pk: غلط/ نامناسب

source: Convenient
ur_pk: معقول

source: Compatible
ur_pk: موافق/ سازگار

source: Decay
ur_pk: بوسیدہ ہونا/ تباہ ہونا

source: Rust
ur_pk: زنگ لگنا/ خراب ہونا

source: Blemish
ur_pk: دھبا لگانا، بدنام کرنا

source: Garbage
ur_pk: گند بلا

source: Preserve
ur_pk: حفاظت کرنا محفوظ کرنا

source: Value
ur_pk: قیمت

source: Decorated
ur_pk: سجایا ہوا

source: Simple, plain
ur_pk: سادہ

source: Glory
ur_pk: تعریف

source: Time
ur_pk: وقت

source: Period of time
ur_pk: وقت کے لمحات

source: Calendar
ur_pk: جنتری،تقویمِ فہرست، کیلنڈر

source: Day
ur_pk: دِن

source: Night
ur_pk: رات

source: Yesterday, today, tomorrow
ur_pk: کل

source: Time of the day
ur_pk: دن کا وقت

source: Week
ur_pk: ہفتہ

source: Days of the week
ur_pk: ہفتے کے دِن

source: Month
ur_pk: ماہ،مہینے

source: Months of the year
ur_pk: سال کے مہینے

source: Season
ur_pk: موسم

source: Year
ur_pk: سال

source: Era
ur_pk: تاریخی دور،سن، شمسی وغیرہ

source: Special days
ur_pk: خاص دِن

source: Take time
ur_pk: وقت لینا

source: A short time
ur_pk: مختصر وقت

source: A long time
ur_pk: لمبا عرصہ

source: Forever
ur_pk: ہمیشہ کے لیے

source: Temporary
ur_pk: عارضی

source: Indefinite time
ur_pk: غیر مقرر، غیر معین

source: Telling time
ur_pk: وقت بتانا

source: Plan a time
ur_pk: وقت کی منصوبہ بندی

source: Clock, watch
ur_pk: گھڑی

source: Relative time
ur_pk: متعلقہ وقت

source: Order, sequence
ur_pk: مطابقت

source: Series
ur_pk: سلسلہ

source: First
ur_pk: پہلے

source: Next
ur_pk: اگلا

source: Last
ur_pk: آخری

source: Regular
ur_pk: باقائدہ

source: Alternate
ur_pk: متبادلہ

source: Before
ur_pk: پہلے

source: After
ur_pk: کے بعد

source: At the same time
ur_pk: ایک ہی وقت میں

source: During
ur_pk: دوران

source: Right time
ur_pk: صحیح وقت

source: Early
ur_pk: جلد

source: On time
ur_pk: وقت پر

source: Late
ur_pk: دیر سے یا دیر

source: Delay
ur_pk: تاخیر

source: Postpone
ur_pk: ملتوی کرنا

source: Aspectual time
ur_pk: غیر متعین، غیر رسمی وقت

source: Start something
ur_pk: شروع کرنا یا ہونا

source: Beginning
ur_pk: آغاز

source: Stop something
ur_pk: کسی چیز کو روکنا

source: End
ur_pk: اختتام

source: Until
ur_pk: جب تک

source: Since, from
ur_pk: سے

source: Past
ur_pk: ماضی

source: Recently
ur_pk: حال ہی میں

source: Present
ur_pk: حال

source: Now
ur_pk: اب

source: Future
ur_pk: مستقبل

source: Soon
ur_pk: جلدی

source: Not yet
ur_pk: ابھی نہیں

source: Eventually
ur_pk: حادثاتی طور پر

source: Immediately
ur_pk: جلدی

source: Age
ur_pk: عمر

source: Young
ur_pk: جوانی

source: Old, not young
ur_pk: بوڑھا

source: New
ur_pk: نیا

source: Old, not new
ur_pk: پرانا

source: Modern
ur_pk: جدید

source: Old fashioned
ur_pk: پرانی فیشن

source: Once
ur_pk: ایک دفعہ

source: Again
ur_pk: ایک بار پھر

source: Sometimes
ur_pk: بعض دفعہ

source: Often
ur_pk: اکثر

source: All the time
ur_pk: تمام وقت

source: Every time
ur_pk: ہر وقت

source: Never
ur_pk: کبھی نہیں

source: Continue, persevere
ur_pk: جاری رکھنا

source: Interrupt
ur_pk: مداخلت کرنا،سلسلہ توڑ دینا

source: Start again
ur_pk: دوبارہ شروع ہونا

source: Interval
ur_pk: وقفے

source: Speed
ur_pk: رفتار

source: Quick
ur_pk: جلدی

source: Slow
ur_pk: آہستہ

source: Sudden
ur_pk: اچانک

source: Location
ur_pk: معینہ مقام

source: Here, there
ur_pk: یہاں/ وہاں

source: In front of
ur_pk: سامنے

source: Behind
ur_pk: پیچھے

source: Beside
ur_pk: ساتھ

source: Around
ur_pk: ارد گرد

source: Between
ur_pk: درمیان

source: On
ur_pk: پر

source: Above
ur_pk: اوپر

source: Under, below
ur_pk: نیچے

source: Inside
ur_pk: اندر

source: Out, outside
ur_pk: باہر

source: Touching, contact
ur_pk: ملے ہوئے

source: Across
ur_pk: ساتھ،سامنے

source: Indefinite location
ur_pk: غیر مقررہ، غیر معتین جگہ

source: Direction
ur_pk: سمت

source: Forward
ur_pk: آگے

source: Backward
ur_pk: پیچھے

source: Right, left
ur_pk: دائیں، بائیں

source: Up
ur_pk: اوپر

source: Down
ur_pk: نچے

source: Away from
ur_pk: دور

source: Towards
ur_pk: آگے

source: North, south, east, west
ur_pk: شمال، جنوب،مشرق، مغرب

source: Be at a place
ur_pk: جگہ پر ہونا

source: Absent
ur_pk: غیر حاضر

source: Area
ur_pk: علاقہ

source: Vicinity
ur_pk: پڑوس، قربت، قرب و جوار

source: Occupy an area
ur_pk: علاقہ قابض ہونا

source: Space, room
ur_pk: جگہ، کمرہ

source: Interval, space
ur_pk: وقفہ، خلا

source: Spatial relations
ur_pk: دُنیاوی یا فضائی تعلق

source: Parts of things
ur_pk: چیزوں کے اجزاء

source: Front
ur_pk: سامنے

source: Back
ur_pk: پیچھے

source: Top
ur_pk: سب سے اوپر/ چوٹی

source: Bottom
ur_pk: تہہ

source: Side
ur_pk: طرف/ جانب

source: Inner part
ur_pk: اندرونی حصہ

source: Outer part
ur_pk: بیرونی حصہ

source: Middle
ur_pk: درمیان

source: Edge
ur_pk: کنارہ

source: End, point
ur_pk: اختتام

source: Grammar
ur_pk: گرائمر

source: General words
ur_pk: عام الفاظ

source: Be
ur_pk: ہونا

source: Exist
ur_pk: موجود ہونا

source: Become, change state
ur_pk: ہونا، منصب تبدیل کرنا یا ہونا

source: Have, of
ur_pk: رکھنا

source: Attribution
ur_pk: منسوبیت، وَصف

source: Do
ur_pk: کرنا

source: Happen
ur_pk: واقع ہونا

source: React, respond
ur_pk: ردعمل

source: Create
ur_pk: بنانا

source: Design
ur_pk: ڈیزائن

source: Make
ur_pk: بنانا

source: Change something
ur_pk: کسی چیز کا بدلنا

source: Thing
ur_pk: اشیأ

source: Physical, non-physical
ur_pk: جسمانی، غیر جسمانی

source: Situation
ur_pk: حالت

source: General adjectives
ur_pk: عام اسم صفت

source: Part of speech
ur_pk: اجزائے کلام

source: Adjectives
ur_pk: اسم صفت

source: Adverbs
ur_pk: متعلق فعل

source: Pronouns
ur_pk: اسمِ ضمیر

source: Reflexive pronouns
ur_pk: وہ اسم ضمیر جو فاعل کی طرف راغب ہوں

source: Indefinite pronouns
ur_pk: غیر مقررہ یا غیر معین اسمِ ضمیر

source: Relative pronouns
ur_pk: لازم وملزوم یا منحصر اسِم ضمیر

source: Question words
ur_pk: سوالیہ الفاظ

source: Demonstrative pronouns
ur_pk: اسم اشارہ

source: Personally
ur_pk: ذاتی

source: Prepositions, postpositions
ur_pk: حروف جار

source: Conjunctions
ur_pk: حروف عطف

source: Phrase conjunctions
ur_pk: جملوں میں حروف عطف

source: Particles
ur_pk: چھوٹا سا بول جس میں کوئی تصریف نہ ہو

source: Classifiers
ur_pk: درجہ بندی

source: Interjections
ur_pk: حروف ندائیہ/ فجائیہ

source: Idiophones
ur_pk: مخصوص بولی

source: Affixes
ur_pk: سابقے اور لاحقے

source: Verb affixes
ur_pk: فعل کے لاحقے

source: Noun affixes
ur_pk: اسم کے ساتھ لاحقے

source: Derivational affixes
ur_pk: ماخوذ لاحقے

source: Very
ur_pk: بہت

source: Degree
ur_pk: درجہ

source: To a large degree
ur_pk: بڑا درجہ

source: To a small degree
ur_pk: چھوٹا درجہ

source: To a larger degree
ur_pk: بڑے درجے

source: To a smaller degree
ur_pk: کم درجہ

source: Completely
ur_pk: مکمل طور پر

source: Partly
ur_pk: جزوی طور پر

source: Do intensely
ur_pk: شدت سے کرنا

source: Attribution of an attribute
ur_pk: وصفی صفات

source: Tense and aspect
ur_pk: جملے اور پہلو

source: Tense
ur_pk: جملہ

source: Aspect--dynamic verbs
ur_pk: پہلو–متحرک فعل

source: Aspect--stative verbs
ur_pk: پہلو–وہ فعل حال ماضی کا ہو۔

source: Relational tenses
ur_pk: تعلقی جملے

source: Agent-oriented modalities
ur_pk: فاعل–ایسا عامل جس کی رغبت اندازِ فعل کے متعلق ہو

source: Can
ur_pk: سکنا

source: Can't
ur_pk: نہ کر سکنا

source: Necessary
ur_pk: لازمی

source: Moods
ur_pk: کسی کے جذبات،احساسات

source: Imperative
ur_pk: واجب، ضروری، صیغہِ امر

source: Hortative
ur_pk: تقاضہ کرنے یا ابھارنے والے الفاظ

source: Interrogative
ur_pk: استفہامیہ، سوالیہ،استفسار کے طور پر

source: Epistemic moods
ur_pk: مذہبی احساس یا لکھے ہوے جذبات

source: Sure
ur_pk: یقینی

source: Possible
ur_pk: ممکن

source: Uncertain
ur_pk: غیر یقینی

source: Unsure
ur_pk: غیر یقینی

source: Think so
ur_pk: اس طرح

source: Maybe
ur_pk: ہو سکتا ہے

source: Seem
ur_pk: دکھائی دیتا ہے

source: Just, almost not
ur_pk: بجا/

source: Don't think so, doubt it
ur_pk: اس طرح نہیں

source: Impossible
ur_pk: ناممکن

source: Evidentials
ur_pk: ثبوتی

source: Evaluator
ur_pk: اندازہ لگانے والا

source: Yes
ur_pk: ہاں

source: No, not
ur_pk: نہ /نہیں

source: Markers expecting an affirmative answer
ur_pk: ایسی توقعاتی علامتیں جو کسی جواب کو پکا کرنے کے لیے دی جائیں، ہاں،جی وغیرہ

source: Markers expecting a negative answer
ur_pk: ایسی علامتیں جو کسی سوال کے جواب میں نفی کریں

source: Adverbial clauses
ur_pk: توسیعی فعل یعنی متعلق فعل کے جملے

source: Case
ur_pk: صورت/ حالت

source: Primary cases
ur_pk: ابتدائی صورتیں

source: Beneficiary of an event
ur_pk: وظیفہ خواری کا واقعہ

source: Instrument
ur_pk: آلات

source: Means
ur_pk: ذرائع

source: Way, manner
ur_pk: طریقہ

source: Attendant circumstances
ur_pk: خدمت گزار، متعلقہ واقعات کے حالات

source: Spatial location of an event
ur_pk: فضائی جگہ

source: Source (of movement)
ur_pk: حرکت کے ذرائع

source: Path (of movement)
ur_pk: چلنے کا راستہ

source: Goal (of movement)
ur_pk: منزل مقصود

source: Semantically similar events
ur_pk: ایسے واقعات جن کا معنی، موقف ایک ہو

source: Together
ur_pk: ایک ساتھ

source: With, be with
ur_pk: کے ساتھ

source: With, do with someone
ur_pk: کے ساتھ، کسی کے ساتھ

source: Each other
ur_pk: ایک دوسرے

source: In groups
ur_pk: گروہوں میں

source: Patient-related cases
ur_pk: متعمل حالات

source: Beneficiary (of a patient)
ur_pk: وظیفہ/ حمایت

source: Recipient (of a patient)
ur_pk: لینے والا، حاصل کرنے والا

source: With (a patient)
ur_pk: کے ساتھ

source: Connected with, related
ur_pk: کسی کے ساتھ منسلک

source: Coordinate relations
ur_pk: ایک جیسے، محدود، برابر تعلق

source: And, also
ur_pk: اور/ بھی

source: Or, either
ur_pk: یا

source: Association
ur_pk: تنظیم

source: Combinative relation
ur_pk: متحدہ یا اجتمائی تعلق

source: But
ur_pk: لیکن

source: Except
ur_pk: ماسوائے

source: Instead
ur_pk: کے باوجود

source: Dissociation
ur_pk: رابطہ ختم کرنا، تعلق ختم کرنا

source: Distribution
ur_pk: تقسیم

source: Equivalence
ur_pk: برابری

source: Dependency relations
ur_pk: منحصر یا انحصار رکھنے والا تعلق

source: Derivation
ur_pk: اسخراج،اخذ

source: Limitation of topic
ur_pk: مضمون کی احاطہ بندی، حد یا مجبوری

source: In general
ur_pk: عام طور پر

source: Relations involving correspondences
ur_pk: ربطِ تعلق، موافقت

source: Basis
ur_pk: بنیادیں

source: Cause
ur_pk: وجہ

source: Reason
ur_pk: وجہ

source: Without cause
ur_pk: وجہ بغیر

source: Result
ur_pk: نتیجہ

source: Without result
ur_pk: بغیر نتیجہ

source: Purpose
ur_pk: مقصد

source: Without purpose
ur_pk: مقصد بغیر

source: Concession
ur_pk: رعایت، مراعات

source: Discourse markers
ur_pk: گفتگو یا بحث کے نشان

source: Markers of transition
ur_pk: زبان یا سُر کو تبدیل کرنے والے نشان

source: Markers of emphasis
ur_pk: زور ڈالنے والے نشان

source: Prompters of attention
ur_pk: ایسے الفاظ جو توّجہ دلوانیں

source: Markers of direct address
ur_pk: توّجہ مرکوز کروانیں والے

source: Markers of identificational and explanatory clauses
ur_pk: ایسے جو وضاحت پیش کریں

source: Markers of focus
ur_pk: ڻکصوص کرنا

source: Hesitation fillers
ur_pk: ہچکچاہٹ

source: Name
ur_pk: نام

source: Name of a person
ur_pk: شخص کا نام

source: Personal names
ur_pk: ذاتی نام

source: Family names
ur_pk: خاندانوں کے نام

source: Clan names
ur_pk: کنبوں/فرقوں کے نام

source: Tribal names
ur_pk: قبیلوں کے نام

source: Names of languages
ur_pk: زبانوں کے نام

source: Nickname
ur_pk: لقب/عرف

source: Terms of endearment
ur_pk: شگفتگی، پیار والے الفاظ

source: Name of a place
ur_pk: جگہوں کے نام

source: Names of countries
ur_pk: ملکوں کے نام

source: Names of regions
ur_pk: علاقوں کے نام

source: Names of cities
ur_pk: شہروں کے نام

source: Names of streets
ur_pk: گلیوں کے نام
