Repository: johntseng/webonary
Catalog: wp-resources/plugins/sil-dictionary-webonary/include/lang/sil_dictionary-*.po
Languages: ur_pk

source: Names of heavenly bodies
ur_pk: اجزائے فلکیات کے نام

source: Names of continents
ur_pk: براعظموں کے نام

source: Names of mountains
ur_pk: پہاڑوں کے نام

source: Names of oceans and lakes
ur_pk: بحیروں اور جھیلوں کے نام

source: Names of rivers
ur_pk: دریاؤں کے نام

source: Name of a thing
ur_pk: کسی چیز کا نام

source: Names of animals
ur_pk: جانوروں کے نام

source: Names of buildings
ur_pk: عمارتوں کے نام

source: Because of the brevity of your search term, partial search was omitted.
ur_pk: آپ کے مختصر کلیدی تلاش کی وجہ سے جُزوی تلاش کو نظرانداز کردیا گیا۔

source: Click here to include searching through partial words.
ur_pk: جزوی الفاظ میں تلاش شامل کرنے کے لئے یہاں کلک کیجئے۔

source: All Parts of Speech
ur_pk: تمام قواعدی اجزاء

source: All Languages
ur_pk: تمام زبانیں

source: Last update:
ur_pk: آخری تبدیلی:

source: Date published:
ur_pk: شائع کرنے کی تاریخ:

source: Number of entries
ur_pk: اندراج کی تعداد

source: Publication Status
ur_pk: شائع کرنے کی صورتِ حال

# text direction
source: ltr
ur_pk: rtl
