Repository: johntseng/webonary
Catalog: wp-resources/plugins/sil-dictionary-webonary/include/lang/sil_dictionary-*.po
Languages: ur_pk

source: Entrust to the care of
ur_pk: ذمہ سونپنا

source: Meddle
ur_pk: دخل دینا، دست اندازی کرنا

source: Spoil
ur_pk: بگاڑنا/ خراب کرنا

source: Enter by force
ur_pk: زور سے اندر آنا یا ہونا

source: Kidnap
ur_pk: اغوا کرنا

source: Cruel
ur_pk: ظلم

source: Honest
ur_pk: دیانت دار

source: Dishonest
ur_pk: بد دیانت

source: Faithful
ur_pk: وفادار

source: Reliable
ur_pk: قابل یقین، قابل اعتماد،اپنے الفاظ پہ ٹھہرا ہوا

source: Unreliable
ur_pk: غیر زمہ دار، غیر موزوں

source: Deceive
ur_pk: فریب۔دھوکہ دہی

source: Hypocrite
ur_pk: بخیلی، منافق

source: Self-controlled
ur_pk: ضابطے والا، نفس پہ قابو کیا ہوا

source: Lack self-control
ur_pk: بے تاب،نفس پر قابو نہ پانا

source: Tidy
ur_pk: صاف ستھرا،سلیقہ شعار، خوش اطوار

source: Untidy
ur_pk: نا صاف ، غیر سلیقہ پن

source: Mistake
ur_pk: غلطی

source: Polite
ur_pk: شائستہ

source: Impolite
ur_pk: ناشائستہ

source: Crazy
ur_pk: غیر معقول/ نے تحاشا

source: Change behavior
ur_pk: اخلاق تبدیل ہونا

source: Conform
ur_pk: پکا،مسحکم، توثیق کرنا

source: Culture
ur_pk: ثقافت

source: Custom
ur_pk: رواج

source: Habit
ur_pk: عادت

source: Prosperity, trouble
ur_pk: خوشحالی/ مصیبت

source: Prosperity
ur_pk: خوشحالی

source: Trouble
ur_pk: تلاطم پیدا کرنا، تکلیف، مصیبت

source: Problem
ur_pk: مسلئہ

source: Danger
ur_pk: خطرہ

source: Accident
ur_pk: حادثہ

source: Disaster
ur_pk: آفت

source: Separate, alone
ur_pk: علیہدہ، اکیلا

source: Suffer
ur_pk: مبتلا ہونا

source: Respond to trouble
ur_pk: مشکل کا مقابلہ کرنا یا کُشائی کرنا

source: Brave
ur_pk: بہادر

source: Cowardice
ur_pk: نامرد، ڈرپوک، بزدل

source: Avoid
ur_pk: بچنا

source: Caution
ur_pk: خبرداری، ہوشیاری،احتیاط

source: Solve a problem
ur_pk: مسلے کو حل کرنا

source: Endure
ur_pk: برداشت کرنا

source: Survive
ur_pk: گزارہ کرنا ، بچنا

source: Respond to someone in trouble
ur_pk: کسی کی مشکل کُشائی کرنا، یا مدد کرنا

source: Mercy
ur_pk: رحم

source: Show sympathy, support
ur_pk: ہمدردی دکھانا، مدد کرنا

source: Gentle
ur_pk: مسکین، بھلا مانس، شریف

source: Save from trouble
ur_pk: مشکل سے بچانا

source: Protect
ur_pk: حفاظت کرنا

source: Free from bondage
ur_pk: بندھن سے آزاد

source: Relief
ur_pk: رہائی/ مصیبت۔ پریشانی سے نجات

source: Risk
ur_pk: خطرہ، خوف، جوکھم

source: Chance
ur_pk: موقع یا قسمت

source: Lucky
ur_pk: خوش قسمتی

source: Unlucky
ur_pk: بد قسمتی

source: Authority
ur_pk: اختیار یا طاقت

source: Person in authority
ur_pk: شخصی اختیار

source: Have authority
ur_pk: اتھارٹی یا طاقت رکھنا

source: Exercise authority
ur_pk: طاقت کا استعمال

source: Lead
ur_pk: قیادت

source: Command
ur_pk: حکم دینا

source: Discipline, train
ur_pk: ضبط یا تیار

source: Appoint, delegate
ur_pk: مقرر کرنا، بھیجنا

source: Submit to authority
ur_pk: اختیار کے آگے حکم بجا لانا

source: Obey
ur_pk: حکم بجا لانا، فرمانی کرنا

source: Disobey
ur_pk: نا فرمانی کرنا

source: Serve
ur_pk: خدمت کرنا

source: Slave
ur_pk: غلام

source: Follow, be a disciple
ur_pk: پیروی کرنا، شاگرد بننا

source: Rebel against authority
ur_pk: منصب یا اختیار کے خلاف بغاوت

source: Independent
ur_pk: آزاد

source: Honor
ur_pk: عزت

source: Title, name of honor
ur_pk: عزت کا نام

source: Lack respect
ur_pk: عزت کی کمی

source: Status
ur_pk: منصب

source: High status
ur_pk: اعلیٰ عہدہ

source: Low status
ur_pk: کم منصب

source: Government
ur_pk: حکومت

source: Ruler
ur_pk: حکمران

source: King's family
ur_pk: بادشاہ کا خاندان

source: Government official
ur_pk: حکومتی امور

source: Citizen
ur_pk: شہری

source: Foreigner
ur_pk: اجنبی، غیر ملکی

source: Government organization
ur_pk: نظم و نسق کی تنظیم

source: Governing body
ur_pk: حکومتی کابینہ

source: Rule
ur_pk: حکمرانی کرنا

source: Subjugate
ur_pk: محکوم ہونا یا کرنا

source: Government functions
ur_pk: حکومتی امور

source: Police
ur_pk: پولیس، مددگار

source: Arrest
ur_pk: گرفتار کرنا

source: Informal justice
ur_pk: غیر رسمی انصاف

source: Diplomacy
ur_pk: مطلب برآری، حکمتِ عملی

source: Represent
ur_pk: نمائندگی کرنا

source: Election
ur_pk: ووٹ

source: Politics
ur_pk: سیاست

source: Region
ur_pk: علاقہ

source: Country
ur_pk: ملک

source: City
ur_pk: شہر

source: Countryside
ur_pk: گاؤں

source: Community
ur_pk: کمیونٹی

source: Law
ur_pk: قانون

source: Laws
ur_pk: قوانین

source: Pass laws
ur_pk: قانون بنانا

source: Break the law
ur_pk: قانون شکنی کرنا

source: Court of law
ur_pk: عدالت

source: Legal personnel
ur_pk: عدالتی ملازم

source: Trial
ur_pk: مقدمہ/ عدالتی کاروائی

source: Investigate a crime
ur_pk: جرم کی تفتیش کرنا

source: Suspect
ur_pk: شک کرنا

source: Accuse, confront
ur_pk: الزام لگانا، آمنا سامنا کرنا

source: Defend against accusation
ur_pk: الزام کی دفاع کرنا

source: Witness, testify
ur_pk: گواہ، گواہی دینا

source: Drop charges
ur_pk: الزام ہٹانا

source: Take oath
ur_pk: قسم لینا

source: Vindicate
ur_pk: بری ثابت کرنا، صحیع ٹھرانا، بول بالا کرنا

source: Judge, render a verdict
ur_pk: جج، فتوی کا حوالہ دینا

source: Acquit
ur_pk: بری کرنا

source: Condemn, find guilty
ur_pk: الزام لگانا، ضبطی کا حکم دینا– سزا وار ٹھہرانا

source: Fault
ur_pk: غلطی

source: Punish
ur_pk: سزا دینا

source: Reward
ur_pk: صِلہ

source: Fine
ur_pk: جرمانہ کرنا

source: Imprison
ur_pk: قید میں ڈالنا

source: Execute
ur_pk: موت دینا، مکمل کرنا

source: Ostracize
ur_pk: جلاوطن کرنا، برادری سے خارج کرنا

source: Pardon, release
ur_pk: معاف کرنا،رہائی دینا

source: Atone, restitution
ur_pk: تلافی کرنا/ تدارک/ کفارہ کرنا

source: Legal contract
ur_pk: قانونی معاہدہ

source: Covenant
ur_pk: عہدوپیماں

source: Break a contract
ur_pk: معاہدہ شکنی کرنا

source: Justice
ur_pk: انصاف

source: Impartial
ur_pk: غیر مشروط،منصافانہ

source: Unfair
ur_pk: ناجائز/ غیر منصفانہ

source: Deserve
ur_pk: مستحق ہونا/ لائق ہونا

source: Discriminate, be unfair
ur_pk: تفرقہ، غیر منصفانہ

source: Act harshly
ur_pk: کھردرا، سخت، بدمزا یا ناگوار کرنا

source: Oppress
ur_pk: تابع/ محکوم ہونا

source: Conflict
ur_pk: تنازعہ

source: Hostility
ur_pk: عداوت/ تضاد/ دشمنی

source: Oppose
ur_pk: مخالفت کرنا

source: Fight
ur_pk: لڑنا

source: Fight for something good
ur_pk: اچھائی کے لئے لڑنا

source: Fight against something bad
ur_pk: برائی کے خلاف لڑنا

source: Attack
ur_pk: حملہ کرنا

source: Ambush
ur_pk: گھات لگا کر

source: Defend
ur_pk: دفاع

source: Revenge
ur_pk: انتقام

source: Riot
ur_pk: غل غپاڑہ، دھنگا، ہنگامہ

source: Betray
ur_pk: دغا سے دشمن کے حوالے کرنا

source: Violent
ur_pk: ظالم/ بدمعاش

source: Enemy
ur_pk: دشمن

source: War
ur_pk: جنگ

source: Defeat
ur_pk: شکست

source: Win
ur_pk: جیت

source: Lose a fight
ur_pk: لڑائی ہارنا

source: Surrender
ur_pk: گرفتار

source: Prisoner of war
ur_pk: جنگی قیدی

source: Military organization
ur_pk: فوجی تنظیم

source: Army
ur_pk: آرمی/ فوجی دستہ

source: Navy
ur_pk: بحریہ

source: Air force
ur_pk: فضائیہ

source: Soldier
ur_pk: فوجی

source: Spy
ur_pk: جاسوسی

source: Fort
ur_pk: قلعہ

source: Weapon, shoot
ur_pk: ہتھیار

source: Plunder
ur_pk: لوٹ مار

source: Peace
ur_pk: امن

source: Rebuke
ur_pk: ملامت کرنا، سرنش کرنا

source: Make an appeal
ur_pk: اپیل کرنا

source: Appease
ur_pk: ڈھارس بندھانا، فرض کرنا، رفع کرنا

source: Negotiate
ur_pk: راضی نامہ

source: Renounce claim, concede
ur_pk: تسلیم کرنا، ماننا، قبول کرنا،–دعویٰ کا ترک کرنا

source: Repent
ur_pk: مزاحمت، توبہ، پشیمانی،

source: Request forgiveness
ur_pk: معافی کی درخواست

source: Forgive
ur_pk: معاف کرنا

source: Make peace
ur_pk: امن کرنا

source: Stop fighting
ur_pk: لڑائی بند کرنا

source: Reconcile
ur_pk: صلح کرنا،متضاد بیان میں توافق بیان کرنا

source: Religion
ur_pk: مذہب

source: God
ur_pk: خُدا، اللہٰ

source: Supernatural being
ur_pk: طاقتور یا زورآور مخلوق، وہ جو نظر نہیں آتی

source: Theology
ur_pk: علم الہیٰ

source: Sacred writings
ur_pk: مقدس تحریر

source: Miracle, supernatural power
ur_pk: مافوق الفطرت طاقت

source: Sorcery
ur_pk: کالا جادو کرنا یا جادو کرنا

source: Demon possession
ur_pk: بد روح شیطان

source: Bless
ur_pk: مقدس بنانا، اقبال مندی کی دُعا کرنا۔ رحم کی دُعا کرنا

source: Curse
ur_pk: بد دعا، لعنت، بلا کا ہونا

source: Destiny
ur_pk: قسمت

source: Prophecy
ur_pk: پیغمبری

source: Omen, divination
ur_pk: کوئی واقعہ سے جسے اچھا یا بُرا شگون لیا جائے،پیشن گوئی، غیب کا حال بتانا

source: Practice religion
ur_pk: مذہبی ہونا، عبادت کرنا

source: Devout
ur_pk: دین دار، پاک سار، خدا پرست، صادق

source: Pray
ur_pk: دُعا

source: Worship
ur_pk: عبادت

source: Religious ceremony
ur_pk: مذہبی تہوار

source: Offering, sacrifice
ur_pk: قربانی

source: Religious purification
ur_pk: مذہبی ہونا، پاک دامن ہونا

source: Taboo
ur_pk: ممنوعات

source: Salvation
ur_pk: معافی،پاک کرنا

source: Dedicate to religious use
ur_pk: مذہبی کاموں کے لیے مجزوب یا مقرر کرنا

source: Fasting
ur_pk: روزہ رکھنا

source: Heaven, hell
ur_pk: جنت، دوزخ

source: Resurrection
ur_pk: موت کے بعد دوبارہ جینا، قیامت کے دِن جینا

source: Religious organization
ur_pk: مذہبی تنظیم

source: Religious person
ur_pk: مذہبی شخص

source: Christianity
ur_pk: عیسائیت

source: Islam
ur_pk: اسلام

source: Hinduism
ur_pk: ہندو مت

source: Buddhism
ur_pk: بدھ مت

source: Judaism
ur_pk: یہودیت

source: Animism
ur_pk: مظاہر پرستی

source: Religious things
ur_pk: مذہبی اشیاء

source: Idol
ur_pk: بے کار بُت

source: Place of worship
ur_pk: جائے عبادت

source: Irreligion
ur_pk: لا دینی

source: Daily life
ur_pk: روزمرہ زندگی

source: Household equipment
ur_pk: گھریلو سامان

source: Table
ur_pk: میز

source: Chair
ur_pk: کرسی

source: Bed
ur_pk: بستر/چارپائی

source: Cabinet
ur_pk: کہلوٹی، الماری

source: Household decoration
ur_pk: گھر کی سجاوٹ

source: Food
ur_pk: خوراک

source: Food preparation
ur_pk: خوراک کی تیاری

source: Cooking methods
ur_pk: کھانے کے طریقے

source: Steps in food preparation
ur_pk: خوراک کی تیاری کے مراحل

source: Remove shell, skin
ur_pk: خول یا چمڑی اُتارنا

source: Pound in mortar and pestle
ur_pk: لنگری میں کوٹنا

source: Grind flour
ur_pk: آٹا پیسنا

source: Cooking utensil
ur_pk: کھانے کے برتن

source: Food storage
ur_pk: خوراک کا ذخیرہ

source: Serve food
ur_pk: روٹی کا پیش کرنا

source: Eat
ur_pk: کھانا

source: Bite, chew
ur_pk: کاٹنا / چبانا

source: Meal
ur_pk: خوراک

source: Feast
ur_pk: دعوت

source: Manner of eating
ur_pk: کھانے کا سلیقہ و طریقہ

source: Hungry, thirsty
ur_pk: بھوکا، پیاسا

source: Satiated, full
ur_pk: بھرا ہوا، سیر ہوا ہوا

source: Drink
ur_pk: پینا

source: Eating utensil
ur_pk: کھانے کے برتن

source: Fast, not eat
ur_pk: روزہ

source: Types of food
ur_pk: خوراک کے اقسام

source: Food from plants
ur_pk: پودوں والی غذائیں

source: Food from seeds
ur_pk: بیجدار غذائیں

source: Food from fruit
ur_pk: پھلدار غذائیں

source: Food from vegetables
ur_pk: سبزی والی غذا

source: Food from leaves
ur_pk: پتوں والی غذا

source: Food from roots
ur_pk: جڑ والی غذا

source: Food from animals
ur_pk: وہ خوراک جو جانوروں سے حاصل کے جاوے

source: Milk products
ur_pk: دودھ کے اشیأ

source: Egg dishes
ur_pk: انڈے کا خوراک

source: Cooking ingredients
ur_pk: پکانے کے اجزا

source: Sugar
ur_pk: چینی

source: Salt
ur_pk: نمک

source: Leaven
ur_pk: خمیر یا خمیر اُٹھانا

source: Cooking oil
ur_pk: پکانے کے تیل

source: Prepared food
ur_pk: تیار خوراک

source: Prohibited food
ur_pk: حرام خوراک

source: Beverage
ur_pk: مشروب

source: Alcoholic beverage
ur_pk: الکحل، مشروبات

source: Alcohol preparation
ur_pk: الکوحل کی تیاری

source: Drunk
ur_pk: شراب

source: Tobacco
ur_pk: تمباکو

source: Narcotic
ur_pk: نشہ آور اشیأ

source: Stimulant
ur_pk: محرک/ اکسانے والا

source: Clothing
ur_pk: کپڑے

source: Men's clothing
ur_pk: مرد کے کپڑے

source: Women's clothing
ur_pk: عورت کے کپڑے

source: Traditional clothing
ur_pk: روایتی کپڑے

source: Clothes for special occasions
ur_pk: خاص تقریب کی پوشاک

source: Clothes for special people
ur_pk: خاص لوگوں کے لیے کپڑے

source: Wear clothing
ur_pk: کپڑے پہننا

source: Naked
ur_pk: ننگا

source: Style of clothing
ur_pk: کپڑوں کا سٹائل

source: Adornment
ur_pk: سج دھج، سنگار، آرائش

source: Cosmetics
ur_pk: چہرے کا سنگار

source: Care for hair
ur_pk: بال کی حفاظت رکھنا

source: Comb hair
ur_pk: بال کنگھے کرنا

source: Plait hair
ur_pk: بالوں کا ڈوری/ لٹ بنانا

source: Dye hair
ur_pk: بالوں کو رنگ دینا

source: Hairstyle
ur_pk: بالوں کی سٹائل

source: Cut hair
ur_pk: بالوں کو کاٹنا

source: Shave
ur_pk: مونڈھنا

source: Care for the teeth
ur_pk: دانتوں کی حفاظت کرنا

source: Anoint the body
ur_pk: جسم کو معطر کرنا/ خوشبو لگانا

source: Ritual scar
ur_pk: رسومی زخم کا نشان/ داغ

source: Circumcision
ur_pk: خُطنہ

source: Care for the fingernails
ur_pk: ناخن کی حفاظت

source: Fire
ur_pk: آگ

source: Light a fire
ur_pk: آگ لگانا

source: Tend a fire
ur_pk: آگ کو ہوا دینا

source: Extinguish a fire
ur_pk: آگ بُجھانا

source: Burn
ur_pk: جلنا

source: What fires produce
ur_pk: آگ کیا متعارف کرتی ہے

source: Fuel
ur_pk: ایندھن

source: Fireplace
ur_pk: آگ کے جگہ، چولہا

source: Cleaning
ur_pk: صفائی یا صفائی کرنا

source: Clean, dirty
ur_pk: صاف، گندہ

source: Bathe
ur_pk: نہانا

source: Wash dishes
ur_pk: برتن دھونا

source: Wash clothes
ur_pk: کپڑے دھونا

source: Sweep, rake
ur_pk: جھاڑو دینا

source: Wipe, erase
ur_pk: صاف کرنا

source: Sleep
ur_pk: سونا

source: Go to sleep
ur_pk: سونے کو جانا

source: Dream
ur_pk: خواب

source: Wake up
ur_pk: جاگنا

source: Manage a house
ur_pk: گھر سنوارنا

source: Live, stay
ur_pk: رہنا، بسیرا کرنا

source: Work and occupation
ur_pk: پیشہ اور کام

source: Work
ur_pk: کام

source: Worker
ur_pk: کارکن

source: Expert
ur_pk: ماھر

source: Method
ur_pk: طریقہ کار

source: Try, attempt
ur_pk: کوشش

source: Use
ur_pk: استعمال

source: Useful
ur_pk: مفید، کار آمد

source: Useless
ur_pk: بے کار

source: Available
ur_pk: دستیاب

source: Use up
ur_pk: استعمال کرنا

source: Take care of something
ur_pk: کسی چیز کی حفاظت

source: Waste
ur_pk: ضائع

source: Work well
ur_pk: کام اچھی طرح کرنا

source: Careful
ur_pk: حفاظت سے بھرپور

source: Work hard
ur_pk: سخت کام

source: Busy
ur_pk: مصروف

source: Power, force
ur_pk: طاقت

source: Complete, finish
ur_pk: مکمل / ختم

source: Ambitious
ur_pk: جذباتی

source: Work poorly
ur_pk: سلیقہ سے کام نہ کرنا، کم یا بُرا کام کرنا

source: Careless, irresponsible
ur_pk: غیر زمہ دار

source: Lazy
ur_pk: سُست

source: Give up
ur_pk: چھوڑنا، ترک کرنا

source: Plan
ur_pk: منصوبہ

source: Arrange an event
ur_pk: پروگرام کا انتظام کرنا

source: Cancel an event
ur_pk: پروگرام کو ملتوی کرنا

source: Prepare
ur_pk: تیار کرنا

source: Prepare something for use
ur_pk: کسی چیز کو استعمال کے لئے تیار کرنا

source: Effective
ur_pk: پراثر

source: Efficient
ur_pk: منافع بخش

source: Opportunity
ur_pk: مو قع

source: Difficult, impossible
ur_pk: مشکل، ناممکن

source: Easy, possible
ur_pk: آسان، ممکن

source: Succeed
ur_pk: کامیاب

source: Fail
ur_pk: ناکام

source: Advantage
ur_pk: فائدہ

source: Job satisfaction
ur_pk: کام سے مطمئن

source: Unemployed, not working
ur_pk: بے روزگار، نکما

source: Made by hand
ur_pk: دستی

source: Artificial
ur_pk: مصنوعی

source: Experienced
ur_pk: تجربہ کار

source: Accustomed to
ur_pk: کسی چیز کے مطابق ہونا

source: Agriculture
ur_pk: ذراعت

source: Growing crops
ur_pk: پیداواری فصل

source: Growing grain
ur_pk: بیج کا لگانا

source: Growing rice
ur_pk: چاول اگانا

source: Growing wheat
ur_pk: گندم اگانا

source: Growing maize
ur_pk: مکئی اگانا

source: Growing potatoes
ur_pk: آلو اگانا

source: Growing cassava
ur_pk: کساوا اگانا

source: Growing vegetables
ur_pk: سبزیاں اگانا

source: Growing fruit
ur_pk: میوہ اگانا

source: Growing grapes
ur_pk: انگور اگانا

source: Growing bananas
ur_pk: کیلا اگانا

source: Growing grass
ur_pk: گھاس اگانا

source: Growing sugarcane
ur_pk: گنا اگانا

source: Growing tobacco
ur_pk: تمباکو اگانا

source: Growing flowers
ur_pk: پھول اُگانا

source: Growing trees
ur_pk: درخت اُگانا

source: Growing coconuts
ur_pk: ناریل اگانا

source: Growing coffee
ur_pk: کافی اگانا

source: Land preparation
ur_pk: زمین کو تیار کرنا یا ہموار کرنا

source: Clear a field
ur_pk: زمین تیار کرنا، تال کرنا

source: Plow a field
ur_pk: کھیت بونا ( کھیتی باڑی کرنا)

source: Fertilize a field
ur_pk: کھیت میں کھاد ڈالنا

source: Plant a field
ur_pk: کھیت بونا، بیج بونا

source: Tend a field
ur_pk: کھیت کی دیکھ بھال کرنا

source: Cut grass
ur_pk: گھاس کاٹنا

source: Uproot plants
ur_pk: پودے اُکھاڑنا

source: Irrigate
ur_pk: آبپاشی کرنا

source: Trim plants
ur_pk: شاخ تراشی کرنا

source: Neglect plants
ur_pk: پودوں کو نظر انداز کرنا

source: Harvest
ur_pk: زخیرہ کرنا، فصل جمع کرنا

source: First fruits
ur_pk: پہلا پھل

source: Crop failure
ur_pk: فصل ناکام ہونا، فصل جھلنا

source: Gather wild plants
ur_pk: جنگلی پودے اکٹھے کرنا

source: Plant product
ur_pk: پیداوار کا لگانا

source: Process harvest
ur_pk: بوائی، کٹائی وغیرہ کے لیے فصل جمع کرنا

source: Winnow grain
ur_pk: ہوا کے زور سے بھوسا الگ کرنا، پنکھ مارنا

source: Mill grain
ur_pk: دانے پیسنا

source: Thresh
ur_pk: غلے کے پودے کو گاہنا، معاملہ کی چھان بین کرنا

source: Store the harvest
ur_pk: فصل یا غلہ کو جمع کرنا

source: Farm worker
ur_pk: دہقان

source: Agricultural tool
ur_pk: زرعی سامان

source: Farmland
ur_pk: کھیت

source: Animal husbandry
ur_pk: جانوروں سے کھیتی باڑی یا جانوروں کی خانہ داری

source: Domesticated animal
ur_pk: گھریلو جانور

source: Cattle
ur_pk: مویشی

source: Sheep
ur_pk: بھیڑ

source: Goat
ur_pk: بکری

source: Pig
ur_pk: سؤر

source: Dog
ur_pk: کُتا

source: Cat
ur_pk: بلی

source: Beast of burden
ur_pk: باربرداری والے جانور (ٹٹو،گدھا، خچر)

source: Tend herds in fields
ur_pk: کھیت میں جانوروں کی غول کی دیکھ بھال

source: Milk
ur_pk: دودھ

source: Butcher, slaughter
ur_pk: قصائی، قربان گاہ

source: Wool production
ur_pk: اونی پیداوار

source: Poultry raising
ur_pk: مُرغیاں پالنا

source: Chicken
ur_pk: مُرغیاں

source: Animal products
ur_pk: جانوروں سے حاصل کی گئی پیداوار (دودھ،چمڑا،گوشت،انڈے،خون)

source: Veterinary science
ur_pk: علاج حیوانات کے مطابق

source: Animal diseases
ur_pk: جانوروں کے بیماریاں

source: Castrate animal
ur_pk: جانوروں کو خصی کرنا

source: Hunt and fish
ur_pk: شکار

source: Hunt
ur_pk: شکار

source: Track an animal
ur_pk: جانور کا پیچھا کرنا

source: Trap
ur_pk: جال/ پنجرہ

source: Hunting birds
ur_pk: پرندوں کا شکار کرنا

source: Beekeeping
ur_pk: شہد کی مکھیاں پالنا

source: Fishing
ur_pk: مچھلیاں پکڑنا

source: Fish with net
ur_pk: جال سے مچھلیاں پکڑنا

source: Fish with hooks
ur_pk: کانٹے سے مچھلیاں پکڑنا

source: Fishing equipment
ur_pk: مچھلیاں پکڑنے کا سامان

source: Things done to animals
ur_pk: جانوروں کو سدھارنے کا کام

source: Working with buildings
ur_pk: عمارتی کام

source: Building
ur_pk: عمارت

source: House
ur_pk: گھر

source: Land, property
ur_pk: زمیں، جائیداد

source: Yard
ur_pk: صحن

source: Fence, wall
ur_pk: دیوار ، باڑ

source: Parts of a building
ur_pk: عمارت کے حصے

source: Wall
ur_pk: دیوار

source: Roof
ur_pk: چھت

source: Floor
ur_pk: فرش

source: Door
ur_pk: دروازہ

source: Window
ur_pk: کھڑکی

source: Foundation
ur_pk: بنیاد

source: Room
ur_pk: کمرہ

source: Floor, story
ur_pk: فرش یا سطح

source: Building equipment and maintenance
ur_pk: عمارت کے لئے آلات اور دیکھ بھال

source: Infrastructure
ur_pk: خدوخال، عوامی فلاح و بہبود

source: Road
ur_pk: سڑک

source: Boundary
ur_pk: سرحد ، حد

source: Occupation
ur_pk: پیشہ

source: Working with cloth
ur_pk: کپڑے کا کام کرنے والا یا درزی

source: Cloth
ur_pk: کپڑا

source: Spinning thread
ur_pk: دھاگہ کاتنا

source: Knitting
ur_pk: بُننا

source: Weaving cloth
ur_pk: کپڑوں کو جوڑنا/سانٹھنا

source: Working with minerals
ur_pk: کان کُنی کرنا

source: Mining
ur_pk: کان کُنی

source: Smelting
ur_pk: دھات کی پگھلائی

source: Working with metal
ur_pk: لوہے کا کام کرنا

source: Working with clay
ur_pk: لَس مٹی کا کام کرنا

source: Working with glass
ur_pk: شیشے کا کام کرنا

source: Working with oil and gas
ur_pk: تیل اور گیس کا کام کرنا

source: Working with stone
ur_pk: پتھروں کا کام کرنا

source: Working with bricks
ur_pk: اینٹیں بنانا

source: Working with chemicals
ur_pk: کیمیائی کام کرنا

source: Explode
ur_pk: پھوٹنا/ اڑنا

source: Working with wood
ur_pk: چوب کاری

source: Lumbering
ur_pk: ہری کشی کرنا

source: Wood
ur_pk: لکڑی

source: Working with paper
ur_pk: کاغذ کا کام کرنا

source: Crafts
ur_pk: کاری گری،ہنر مندی، دست کاری،مکاری، ہوشیاری

source: Cordage
ur_pk: رسی

source: Weaving baskets and mats
ur_pk: ٹوکریاں اور چارپائیاں بننا

source: Working with leather
ur_pk: چمڑے کا کام کرنا

source: Working with bone
ur_pk: ہڈیوں کا کام کرنا

source: Art
ur_pk: فن

source: Draw, paint
ur_pk: تصویر بنانا

source: Photography
ur_pk: تصویر بنانا

source: Sculpture
ur_pk: سنگ تراشی، مجسمہ سازی

source: Working with land
ur_pk: زمین داری کرنا

source: Working with water
ur_pk: پانی کا کام مثلاً آبپاشی کرنا

source: Plumber
ur_pk: پلمبر /نل ساز

source: Conveying water
ur_pk: پلمبری کرنا، پانی مہیا کرنا

source: Controlling water
ur_pk: ڈیم بنانا،پانی کو قابو میں رکھنا

source: Working in the sea
ur_pk: سنمدر میں کام کرنا

source: Working with machines
ur_pk: مشینی کام

source: Working with electricity
ur_pk: بجلی کا کام

source: Tool
ur_pk: آلات/ اوزار

source: Cutting tool
ur_pk: کاٹنے والے اوزار

source: Poking tool
ur_pk: سوراخ کرنے والے اوزار

source: Digging tool
ur_pk: کھُدائی والے اوزار

source: Pounding tool
ur_pk: کوٹنے والے ہتھیار یا اوزار مثلاَ ہتھوڑا وغیرہ

source: Carrying tool
ur_pk: اُٹھانے والے اوزار

source: Lifting tool
ur_pk: ہٹانے کے اوزار

source: Fastening tool
ur_pk: باندھنے کے اوزار

source: Holding tool
ur_pk: پکڑنے کے اوزار

source: Container
ur_pk: ایک قسم کاڈبہ یعنی برتن

source: Bag
ur_pk: تھیلا

source: Sheath
ur_pk: نیام، غلاف، خول

source: Parts of tools
ur_pk: اوزاروں کے حصے

source: Machine
ur_pk: مشین

source: Finance
ur_pk: مالیہ، مالیات، مال گزاری، آمدنی،محاصل، سرمایہ لگانا،مالی کاروبار کرنا

source: Have wealth
ur_pk: دولت مند ہونا، دولت رکھنا

source: Own, possess
ur_pk: ملکیت

source: Rich
ur_pk: امیر

source: Poor
ur_pk: غریب

source: Store wealth
ur_pk: دولت جمع کرنا

source: Possession, property
ur_pk: جائیداد

source: Accumulate wealth
ur_pk: مالی فراوانی، دولت جمع کرنا، اکٹھا کرنا، ڈھیر لگانا

source: Produce wealth
ur_pk: دولت پیدا کرنا

source: Make profit
ur_pk: نفع کمانا، مال بنانا

source: Lose wealth
ur_pk: دولت گنوانا،

source: Frugal
ur_pk: کفایت شعار، کم خرچ، فضول خرچی سے بچنے والا،سلامت رو

source: Greedy
ur_pk: لالچی

source: Collect
ur_pk: جمع کرنا

source: Earn
ur_pk: کمانا

source: Share wealth
ur_pk: دولت میں شریک ہونا، دولت شیئر کرنا

source: Give, donate
ur_pk: عطیہ دینا

source: Generous
ur_pk: سخی،فیاض،بلند حوصلہ، دریا دِل، عالی ہمت

source: Stingy
ur_pk: کنجوس، بخیل

source: Beg
ur_pk: بھیگ مانگنا

source: Financial transaction
ur_pk: مالیاتی کاروبار

source: Buy
ur_pk: خریدنا

source: Sell
ur_pk: بیچنا

source: Price
ur_pk: قیمت

source: Expensive
ur_pk: قیمتی

source: Cheap
ur_pk: سستا

source: Free of charge
ur_pk: فری

source: Bargain
ur_pk: بھاؤ تاؤ، سودا، معاملہ، چیز جو خریدی جائے

source: Pay
ur_pk: ادا کرنا، پیسے ادا کرنا

source: Hire, rent
ur_pk: کرایہ پر لینا یادینا، اُجرت دے کر کام لینا کرایہ، مالیہ،

source: Spend
ur_pk: خرچ کرنا

source: Store, marketplace
ur_pk: سٹور

source: Exchange, trade
ur_pk: تبادلہ، تجارت

source: Borrow
ur_pk: اُدھار لینا

source: Lend
ur_pk: ادھار دینا

source: Give pledge, bond
ur_pk: گروی دینا، بانڈ

source: Owe
ur_pk: مقروض ہونا، ممنون ہونا، زیر بار احسان ہونا

source: Repay debt
ur_pk: قرض ادا کرنا

source: Credit
ur_pk: اعتبار، بھروسہ، یقین، اعتماد، شہرت، ساکھ،قرض، ادھار، جمع، وصولی

source: Money
ur_pk: رقم،پیسہ

source: Monetary units
ur_pk: زرکی اکائی

source: Accounting
ur_pk: شماریات، حساب کتاب

source: Tax
ur_pk: ٹیکسٹ

source: Steal
ur_pk: چرانا

source: Cheat
ur_pk: دھوکہ

source: Extort money
ur_pk: رقم کی جبری حصول

source: Take by force
ur_pk: طاقت سے لینا/ چھیننا

source: Bribe
ur_pk: رشوت

source: Smuggle
ur_pk: گھاٹ ماری/ سمگلِنگ

source: Business organization
ur_pk: کاروباری تنظیم

source: Management
ur_pk: انتظام

source: Work for someone
ur_pk: کسی کا کام کرنا

source: Marketing
ur_pk: خریدو فروخت کرنا، منڈی میں لانا

source: Commerce
ur_pk: اصولِ تجارت

source: Economics
ur_pk: معاشیات، اقتصادیات

source: Insurance
ur_pk: معاہدہ
