Repository: johntseng/webonary
Catalog: wp-resources/plugins/sil-dictionary-webonary/include/lang/sil_dictionary-*.po
Languages: ur_pk

source: No entries exist for
ur_pk: لفظ کے لئے کوئی اندراج موجود نہیں

source: No entries exist starting with this letter.
ur_pk: اِس حرف سے شروع ہونے والا کوئی لفظ موجود نہیں۔

source: Rough draft
ur_pk: نا موافق مسودہ

source: Self-reviewed draft
ur_pk: ذاتی دہرائی کا مسودہ

source: Community-reviewed draft
ur_pk: برادری کی دہرائی کا مسودہ

source: Consultant approved
ur_pk: مشیر سے منظور شدہ

source: Finished (no formal publication)
ur_pk: مکمل (رسمی طور پر غیر شائع شدہ)

source: Formally published
ur_pk: رسمی طور پر مکمل

source: Fish
ur_pk: مچھلی

source: Meat
ur_pk: ماس

source: Spice
ur_pk: مصالحہ

source: Bodies of water
ur_pk: اجزائے پانی،پانی کاجسم

source: Cardinal numbers
ur_pk: بنیادی ہندسے

source: Ordinal numbers
ur_pk: اعدادی یا صفاتی ہندسے

source: Land
ur_pk: زمین

source: Hair
ur_pk: بال

source: Skin
ur_pk: چمڑی

source: Stomach
ur_pk: پیٹ

source: Fever
ur_pk: بخار

source: Types of houses
ur_pk: گھروں کی اقسام

source: Furniture
ur_pk: فرنیچر

source: Building materials
ur_pk: عمارتی مواد

source: Jewelry
ur_pk: زیورات

source: Parts of clothing
ur_pk: کپڑوں کے حصے

source: Universe, creation
ur_pk: کائنات

source: Sky
ur_pk: آسمانأ

source: Sun
ur_pk: سُورج

source: Moon
ur_pk: چَاند

source: Star
ur_pk: ستارہ

source: Planet
ur_pk: سیارہ (اجرامِ فَلکی)

source: Air
ur_pk: ہوا

source: Blow air
ur_pk: ہوا دینا یا ہوا مارنا

source: Weather
ur_pk: موسم

source: Wind
ur_pk: جَکھڑ، تیز ہوا

source: Cloud
ur_pk: بادَل

source: Rain
ur_pk: بارش

source: Snow, ice
ur_pk: برف

source: Storm
ur_pk: طوفان، آندھی

source: Lightning, thunder
ur_pk: صاعقہ، بادل کی گرج

source: Flood
ur_pk: سیلاب

source: Drought
ur_pk: خشک سالی، تشنگی

source: World
ur_pk: دنیا

source: Mountain
ur_pk: پہاڑ

source: Volcano
ur_pk: آتش فشاں

source: Plain, plateau
ur_pk: میدان ، سطح مرتفع

source: Valley
ur_pk: وادی

source: Underground
ur_pk: زمین دوز، خفیہ

source: Forest, grassland, desert
ur_pk: ماحولیاتی نظام، ارتعاشی نظام

source: Earthquake
ur_pk: زلزلہ

source: Substance, matter
ur_pk: مواد

source: Soil, dirt
ur_pk: اراضی،زرعی زمین–خاک

source: Rock
ur_pk: چٹان

source: Metal
ur_pk: دھات، لوہا قسم کی چیز

source: Mineral
ur_pk: معدنیات

source: Jewel
ur_pk: لعل جواہر، قیمتی نگینے

source: Solid, liquid, gas
ur_pk: ٹھوس، مائع،گیس

source: Liquid
ur_pk: مائع

source: Oil
ur_pk: تِیل

source: Gas
ur_pk: گیس

source: Water
ur_pk: پانی

source: Ocean, lake
ur_pk: جھیل، جزیرا

source: Swamp
ur_pk: دلدل، دھسن

source: River
ur_pk: دریا

source: Spring, well
ur_pk: کنواں

source: Island, shore
ur_pk: جزیرہ

source: Movement of water
ur_pk: پانی کی حرکت

source: Flow
ur_pk: بہاو

source: Pour
ur_pk: انڈیلنا

source: Drip
ur_pk: قطرہ، رسنا، ٹپکنے والی چیز

source: Wave
ur_pk: لہر

source: Calm, rough
ur_pk: خاموشی

source: Tide
ur_pk: سمندری لہر، موسم،مدوجزری

source: Wet
ur_pk: گیلا

source: Dry
ur_pk: خشک

source: Be in water
ur_pk: پانی میں ہونا

source: Solutions of water
ur_pk: پانی کا محلول

source: Water quality
ur_pk: پانی کی خصوصیت

source: Living things
ur_pk: جاندار اشیأ

source: Dead things
ur_pk: مردہ اشیاء

source: Spirits of things
ur_pk: روحانی اشیاء

source: Plant
ur_pk: پودے

source: Tree
ur_pk: درخت

source: Bush, shrub
ur_pk: جھاڑی

source: Grass, herb, vine
ur_pk: گھاس ، جڑی بوٹیاں، بیلیں

source: Moss, fungus, algae
ur_pk: کائی،فنجائی اور اُشنہ، بحری گھاس

source: Parts of a plant
ur_pk: پودے کے حصے

source: Growth of plants
ur_pk: پودے کی بڑھوتری

source: Plant diseases
ur_pk: پودے کی بیماری

source: Animal
ur_pk: جانور

source: Types of animals
ur_pk: جانوروں کی اقسام

source: Mammal
ur_pk: دودھ پلانے والے جانور

source: Primate
ur_pk: پرائمایٹ

source: Carnivore
ur_pk: گوشت خور جانور یا پودے

source: Rodent
ur_pk: تیز مُنہ والے جانور

source: Marsupial
ur_pk: تھیلی دار جانور

source: Anteater, aardvark
ur_pk: لمبی چونچ اور زبان والے جانور،

source: Sea mammal
ur_pk: سمندردی ممالیہ جانور

source: Bat
ur_pk: چمگادڑ

source: Bird
ur_pk: پرندہ

source: Reptile
ur_pk: رینگنے والے جانور

source: Snake
ur_pk: سانپ

source: Lizard
ur_pk: چھپکلی

source: Turtle
ur_pk: کچھوا

source: Crocodile
ur_pk: مگرمچھ

source: Amphibian
ur_pk: خشکی اور تری میں رہنے والے جانور

source: Shark, ray
ur_pk: شارک، رے (مچھلی)

source: Insect
ur_pk: حشرات

source: Spider
ur_pk: مکڑا

source: Small animals
ur_pk: چھوٹی جانور

source: Parts of an animal
ur_pk: جانوروں کے اجزأ

source: Parts of a bird
ur_pk: پرندوں کے اجزأ

source: Parts of a reptile
ur_pk: رینگنے والے جانوروں کے اجزا

source: Parts of a fish
ur_pk: مچھلی کے حصے یا اجزا

source: Parts of an insect
ur_pk: حشرات کے حصے

source: Parts of small animals
ur_pk: چھوٹے جانورں کے حصے یااجزا

source: Animal life cycle
ur_pk: جانوروں کی زندگی کا نظامِ حیات

source: Egg
ur_pk: انڈا

source: Animal actions
ur_pk: جانوروں کے کام

source: Animal movement
ur_pk: جانوروں کی حرکات

source: Animal eating
ur_pk: جانوروں کا کھانا

source: Animal sounds
ur_pk: جانوروں کی آوازیں

source: Animal home
ur_pk: جانوروں کے گھر

source: Animal group
ur_pk: جانوروں کے گروہ

source: Male and female animals
ur_pk: نر اور مادہ جانور

source: Nature, environment
ur_pk: فطرت اور ماحولیات

source: Natural
ur_pk: قدرتی/ فطرتی

source: Person
ur_pk: شخص

source: Body
ur_pk: جسم

source: Head
ur_pk: سر

source: Eye
ur_pk: آنکھ

source: Ear
ur_pk: کان کا کام

source: Nose
ur_pk: ناک

source: Tooth
ur_pk: دانت

source: Torso
ur_pk: دھڑ

source: Limb
ur_pk: بازو، ٹانگیں

source: Arm
ur_pk: بازو

source: Leg
ur_pk: ٹانگیں

source: Finger, toe
ur_pk: اُنگلی،پنجہ

source: Bone, joint
ur_pk: ہڈی،جوڑ

source: Flesh
ur_pk: ماس

source: Internal organs
ur_pk: اندرونی اجزا

source: Heart
ur_pk: دل

source: Male organs
ur_pk: نر اعضاء

source: Female organs
ur_pk: مادہ اعضاء

source: Body functions
ur_pk: جسم کے کام

source: Breathe, breath
ur_pk: سانس، سانس لینا

source: Cough, sneeze
ur_pk: کھانسی/

source: Spit, saliva
ur_pk: تھوک، منہ کا پانی

source: Mucus
ur_pk: لعابی مادہ

source: Bleed, blood
ur_pk: خون کا بہنا، خون

source: Sweat
ur_pk: پسینہ

source: Urinate, urine
ur_pk: پیشاب کرنا، پیشاب

source: Defecate, feces
ur_pk: ٹٹی کرنا، ٹٹی

source: Sense, perceive
ur_pk: حسیں

source: See
ur_pk: دیکھنا، نظر آنا

source: Look
ur_pk: دیکھنا

source: Watch
ur_pk: دیکھنا

source: Examine
ur_pk: جانچنا

source: Show, let someone see
ur_pk: کسی کو دکھانا

source: Visible
ur_pk: صاف ظاہر، عیاں

source: Appear
ur_pk: ظاہر

source: Transparent
ur_pk: شفاف

source: Reflect, mirror
ur_pk: آئینہ

source: Appearance
ur_pk: ظہور

source: Beautiful
ur_pk: خوبصورت

source: Ugly
ur_pk: بد صورت

source: Something used to see
ur_pk: دیکھنے کے لئے کسی چیز کو استعمال کرنا

source: Hear
ur_pk: سُننا

source: Listen
ur_pk: سننا

source: Sound
ur_pk: آواز

source: Types of sounds
ur_pk: آوازوں کی اقسام

source: Loud
ur_pk: اونچا

source: Quiet
ur_pk: خاموش

source: Taste
ur_pk: ذائقہ

source: Smell
ur_pk: بو

source: Sense of touch
ur_pk: چھونے کی حس

source: Comfortable
ur_pk: آرام

source: Body condition
ur_pk: جسمانی حالت

source: Strong
ur_pk: مضبوط

source: Weak
ur_pk: کمزور

source: Tired
ur_pk: تھکاوٹ

source: Rest
ur_pk: آرام

source: Healthy
ur_pk: صحت مند

source: Sick
ur_pk: بیمار

source: Recover from sickness
ur_pk: بیماری سے شفا پانا

source: Disease
ur_pk: بیماری

source: Malnutrition, starvation
ur_pk: غذائی قلت، فاقہ کشی

source: Skin disease
ur_pk: کوڑھ، جزام

source: Stomach illness
ur_pk: پیٹ کی بیماریاں

source: Tooth decay
ur_pk: دانتوں کا خلا

source: Injure
ur_pk: زخم

source: Amputate
ur_pk: کٹا ہوا، ناکارہ،عضو کا نہ ہونا

source: Poison
ur_pk: زہرکا علاج کرنا کرنا

source: Disabled
ur_pk: فالج ذدہ

source: Blind
ur_pk: اندھا

source: Poor eyesight
ur_pk: کمزور نظر

source: Deaf
ur_pk: بہرہ

source: Mute
ur_pk: گونگا، چُپ چاپ

source: Birth defect
ur_pk: پیدائشی نُقص

source: Cause of disease
ur_pk: بیماری کے اسباب

source: Symptom of disease
ur_pk: بیماری کی علامات

source: Pain
ur_pk: درد

source: Swell
ur_pk: سوجھنا

source: Lose consciousness
ur_pk: ہوش کھونا

source: Dazed, confused
ur_pk: گھبراہٹ بدحواسی– الجھانا، گڈ مڈ کرنا

source: Vision, hallucination
ur_pk: نظر، نگاہ–فریب خیالی، تصورکا دھوکا،لغزس

source: Treat disease
ur_pk: بیماری کا علاج

source: Doctor, nurse
ur_pk: ڈاکٹر،نرس

source: Medicine
ur_pk: دوائی

source: Medicinal plants
ur_pk: جڑی بوٹیاں

source: Hospital
ur_pk: ہسپتال

source: Traditional medicine
ur_pk: روائیتی ادویات

source: Mental illness
ur_pk: ذہنی ناکارہ

source: Life
ur_pk: زندگی

source: Marriage
ur_pk: شادی

source: Arrange a marriage
ur_pk: شادی کا انتظام کرنا

source: Wedding
ur_pk: شادی

source: Unmarried
ur_pk: غیر شادی شُدہ

source: Divorce
ur_pk: طلاق

source: Romantic love
ur_pk: جذباتی محبت

source: Sexual relations
ur_pk: جنسی تعلقات

source: Virginity
ur_pk: کنوارہ پن

source: Attract sexually
ur_pk: جنسی طور پر ُپرکشش

source: Sexual immorality
ur_pk: جنسی بد اخلاقی

source: Birth
ur_pk: پیدائش دینا

source: Pregnancy
ur_pk: حاملہ پن

source: Fetus
ur_pk: فیٹس/ماں کے پیٹ میں موجود بچہ

source: Miscarriage
ur_pk: اسقاطِ حمل

source: Labor and birth pains
ur_pk: پیدائش اور دردِ پیدائش

source: Help to give birth
ur_pk: پیدائش میں مدد کرنا

source: Unusual birth
ur_pk: غیر معمولی پیدائش

source: Multiple births
ur_pk: کئی پیدائشیں

source: Fertile, infertile
ur_pk: بانجھ

source: Birth ceremony
ur_pk: سال گرہ

source: Stage of life
ur_pk: زندگی کے مراحل

source: Baby
ur_pk: بچہ

source: Care for a baby
ur_pk: بچے کی حفاظت کرنا

source: Child
ur_pk: بچہ

source: Rear a child
ur_pk: بچے کی پرورش

source: Youth
ur_pk: جوانی

source: Adult
ur_pk: بالغ،جوان

source: Old person
ur_pk: بوڑھا آدمی

source: Grow, get bigger
ur_pk: بڑا ہوجانا

source: Initiation
ur_pk: باضابطہ شرکت، ابتدا، داخلہ

source: Peer group
ur_pk: ھم عمر ،ہم جماعت

source: Male, female
ur_pk: نر،مادہ

source: Man
ur_pk: مرد

source: Woman
ur_pk: عورت

source: Die
ur_pk: مرنا

source: Kill
ur_pk: مارنا

source: Corpse
ur_pk: لاش

source: Funeral
ur_pk: جنازہ

source: Mourn
ur_pk: ماتم

source: Bury
ur_pk: دفن کرنا

source: Grave
ur_pk: قبر

source: Inherit
ur_pk: ورثہ میں مِلنا، وارث ہونا، خاندانی خصوصیات رکھنا

source: Life after death
ur_pk: موت کے بعد زندگی

source: Language and thought
ur_pk: زبان اور سوچ

source: Soul, spirit
ur_pk: روح،جسم کی روح

source: Personality
ur_pk: شخصییت، انفرادییت

source: Mental state
ur_pk: ذہنی منصب

source: Alert
ur_pk: قدرے ہوشیار

source: Notice
ur_pk: اشارہ

source: Attention
ur_pk: توجہ

source: Ignore
ur_pk: نظرانداز کرنا

source: Think
ur_pk: سوچنا یا خیال کرنا

source: Mind
ur_pk: دماغ

source: Think about
ur_pk: کسی کے بارے میں سوچنا

source: Imagine
ur_pk: تصور میں لانا

source: Intelligent
ur_pk: ذہین

source: Stupid
ur_pk: بیوقوف/ احمق

source: Logical
ur_pk: منطقی

source: Instinct
ur_pk: فطری صلاحیت

source: Learn
ur_pk: سیکھنا , پڑھنا

source: Study
ur_pk: تفتیش کرنا

source: Check
ur_pk: چیک کرنا

source: Evaluate, test
ur_pk: جائزہ لگانا–ٹیسٹ کرنا

source: Guess
ur_pk: اندازہ لگانا

source: Solve
ur_pk: حل کرنا

source: Realize
ur_pk: جاننا/ محسوس کرنا

source: Willing to learn
ur_pk: سیکھنے کو راضی ہونا

source: Know
ur_pk: جاننا

source: Known, unknown
ur_pk: جانا ہوا، انجان

source: Area of knowledge
ur_pk: علم کے احاطے

source: Secret
ur_pk: راز

source: Understand
ur_pk: سمجھنا

source: Misunderstand
ur_pk: غلط فہمی ہونا

source: Understandable
ur_pk: قابلِ فہم

source: Mysterious
ur_pk: مخفی/ باطنی

source: Opinion
ur_pk: رائے

source: Believe
ur_pk: یقین

source: Trust
ur_pk: اعتماد

source: Disbelief
ur_pk: غیر یقین

source: Doubt
ur_pk: شک

source: Agree with someone
ur_pk: متفق

source: Disagree
ur_pk: نا متفق ہونا

source: Protest
ur_pk: اظہار اختلاف/ مخالفانہ ردِ عمل

source: Philosophy
ur_pk: فلسفہ

source: Attitude
ur_pk: رویّہ/ طرز سلوک

source: Extreme belief
ur_pk: عقیدے کی شدّت

source: Change your mind
ur_pk: اپنی رائے بدلنا

source: Approve of something
ur_pk: منظور کرنا

source: Remember
ur_pk: یاد کرنا

source: Forget
ur_pk: بھولنا

source: Recognize
ur_pk: پہچاننا

source: Memorize
ur_pk: رٹہ لگانا

source: Remind
ur_pk: یاد دہانی کرنا

source: Expect
ur_pk: توقع رکھنا

source: Hope
ur_pk: اُمید

source: Hopeless
ur_pk: ناامیدی

source: Predict
ur_pk: پیشن گوئی کرنا

source: Tendency
ur_pk: رجحان

source: Want
ur_pk: خواہش،چاہنا

source: Decide, plan
ur_pk: فیصلہ کرنا–خاکہ، تدبیر، نمونہ تیار کرنا

source: Purpose, goal
ur_pk: مقصد

source: Choose
ur_pk: چُننا

source: Cast lots
ur_pk: قرعہ اندازی کرنا

source: Intend
ur_pk: ارادہ کرنا/ نیت کرنا

source: Deliberately
ur_pk: جان بوجھ کر

source: Determined
ur_pk: فیصلہ کرنا

source: Stubborn
ur_pk: ضدی

source: Lust
ur_pk: خواہش،شہوت

source: Request
ur_pk: درخواست کرنا

source: Agree to do something
ur_pk: کسی کام کے لئے متفق ہونا

source: Refuse to do something
ur_pk: کسی کام کے لئے انکار کرنا

source: Intercede
ur_pk: درمیان میں پڑھنا، کسی کے لیے کوشش کرنا

source: Willing
ur_pk: خواہش

source: Influence
ur_pk: اثر اندازی

source: Suggest
ur_pk: تجویز کرنا

source: Advise
ur_pk: نصیحت کرنا

source: Persuade
ur_pk: مائل کرنا

source: Insist
ur_pk: اصرار

source: Compel
ur_pk: مجبور کرنا

source: Control
ur_pk: قابو کرنا

source: Warn
ur_pk: تنبیہ/خبردار کرنا

source: Threaten
ur_pk: دھمکی دینا

source: Ask permission
ur_pk: اجازت لینا

source: Give permission
ur_pk: اجازت دینا

source: Refuse permission
ur_pk: اجازت سے انکار کرنا

source: Exempt
ur_pk: مستثنیٰ کرنا

source: Prevent
ur_pk: روکنا

source: Free to do what you want
ur_pk: آزادی

source: Offer
ur_pk: پیشکش کرنا، دعوت دینا

source: Accept
ur_pk: قبول کرنا

source: Reject
ur_pk: نظر انداز کرنا

source: Emotion
ur_pk: جذبات

source: Feel good
ur_pk: مثبت جذبات

source: Like, love
ur_pk: پسند، پیار و محبت

source: Enjoy doing something
ur_pk: کسی کام سے لطف اندوز ہونا

source: Self-esteem
ur_pk: فخر، عزت، عزت نفس

source: Prefer
ur_pk: پیش کرنا، زیادہ پسند کرنا

source: Popular
ur_pk: مشہور

source: Fashionable
ur_pk: پابند وضع، وضع دار

source: Contentment
ur_pk: قناعت

source: Happy for
ur_pk: کسی کے لیے خوشی

source: Pleased with
ur_pk: کسی کے ساتھ خوش

source: Happy
ur_pk: خوش

source: Relaxed
ur_pk: سکون

source: Calm
ur_pk: خاموشی/پرسکون

source: Surprise
ur_pk: حیرانگی

source: Interested
ur_pk: دلچسپی رکھنا

source: Excited
ur_pk: پُر جوش

source: Enthusiastic
ur_pk: پر جوش

source: Obsessed
ur_pk: وھم خیال کا مسلط ہوجانا

source: Attract
ur_pk: مائل کرنا

source: Indifferent
ur_pk: بے غرض، معمولی، ہلکا

source: Uninterested, bored
ur_pk: اُکتانے والا

source: Confident
ur_pk: پرُاعتماد

source: Feel bad
ur_pk: منفی جذبات

source: Sad
ur_pk: غمزدہ، افسردہ

source: Dislike
ur_pk: نا پسند

source: Disappointed
ur_pk: ناامید، مایوس

source: Lonely
ur_pk: اکیلا

source: Upset
ur_pk: پریشان۔ بے اطمینان

source: Shock
ur_pk: صدمہ

source: Jealous
ur_pk: حاسد/سڑیَل

source: Discontent
ur_pk: بے چینی، بے قناعتی،غیر مطمعٰن،ناخوش، بیقرار

source: Angry
ur_pk: غصہ

source: Annoyed
ur_pk: اداس

source: Afraid
ur_pk: ڈَر

source: Worried
ur_pk: ڈرنا، پریشان ہونا

source: Nervous
ur_pk: ہیجانی کیفیت میں ہونا

source: Shy, timid
ur_pk: ڈرا ہوا،ڈرپوک،بزدل، خاہف،بے حد شرمیلا

source: Confused
ur_pk: پریشان

source: Communication
ur_pk: رابطہ کاری

source: Say
ur_pk: کہنا

source: Voice
ur_pk: آواز،صوت

source: Shout
ur_pk: چلانا

source: Speak quietly
ur_pk: خاموشی سے بولنا یا بات چیت کرنا

source: Speak a lot
ur_pk: گپ شپی ہونا، زیادہ بولنا

source: Speak little
ur_pk: تھوڑا بولنا

source: Say nothing
ur_pk: خاموش

source: Speech style
ur_pk: بولنے کا انداز

source: Speak well
ur_pk: اچھا بولنا

source: Speak poorly
ur_pk: خراب گفتگو کرنا

source: Talk about a subject
ur_pk: کسی موضوع کے متعلق بات چیت

source: Announce
ur_pk: اعلان کرنا

source: Describe
ur_pk: بیان کرنا

source: Explain
ur_pk: تشریح کرنا

source: Mention
ur_pk: ذکر کرنا

source: Introduce
ur_pk: تعارف کرنا

source: Repeat
ur_pk: دھرانا

source: Summarize
ur_pk: خلاصہ کر نا، مختصر کارنا

source: Emphasize
ur_pk: تاکید، زور، دباو

source: Be about, subject
ur_pk: کسی موضوع کے متعلق

source: True
ur_pk: سچ

source: Tell the truth
ur_pk: سچ بولنا

source: Tell a lie
ur_pk: جھوٹ بولنا

source: Contradict
ur_pk: ناموافقت، نامتفق ہونا

source: Expose falsehood
ur_pk: غلطی پکڑنا، جھوٹ سامنے لانا

source: Real
ur_pk: حقیقت

source: Exaggerate
ur_pk: بڑھانا چڑھانا

source: Speak with others
ur_pk: دوسروں سے بولنا

source: Call
ur_pk: پکار

source: Contact
ur_pk: رابطہ کرنا

source: Greet
ur_pk: مِلنا

source: Say farewell
ur_pk: الوداع کہنا

source: Speak in unison
ur_pk: یک دم بولنا،اکھٹا بولنا

source: Ask
ur_pk: پوچھنا

source: Answer
ur_pk: جواب

source: Disclose
ur_pk: ظاہر کرنا، بتانا

source: Hide your thoughts
ur_pk: اپنے خیالات کو چھپانا

source: Debate
ur_pk: تکرار کرنا

source: Demonstrate
ur_pk: ظاہر کرنا، بتانا، واضع کرنا

source: Quarrel
ur_pk: زبانی جھگڑا کرنا،چوں چُوں کرنا

source: Praise
ur_pk: تعریف

source: Thank
ur_pk: شکریہ

source: Flatter
ur_pk: خوشامد کرنا

source: Boast
ur_pk: شیخی

source: Criticize
ur_pk: نقطہ چینی کرنا

source: Blame
ur_pk: الزام لگانا

source: Insult
ur_pk: بے عزتی کرنا

source: Mock
ur_pk: مذاق اڑانا

source: Gossip
ur_pk: گپ شپ کرنا

source: Complain
ur_pk: شکایت

source: Promise
ur_pk: وعدہ

source: Make speech
ur_pk: تقریر کرنا

source: Report
ur_pk: رپوٹ

source: News, message
ur_pk: خبریں، پیغام

source: Figurative
ur_pk: مجازی، تشبیہی، تمثیل

source: Admit
ur_pk: تسلیم کرنا

source: Language
ur_pk: زبان

source: Word
ur_pk: لفظ

source: Information
ur_pk: معلومات

source: Story
ur_pk: کہانی

source: Fable, myth
ur_pk: فرضی قصہ،کہانی،دیو پری کا افسانہ

source: Saying, proverb
ur_pk: کہاوت

source: Riddle
ur_pk: الگ کرنے کی چھلنی، چھان بیں کرنا

source: Poetry
ur_pk: شاعری

source: History
ur_pk: تاریخ

source: Verbal tradition
ur_pk: زبانی روایت

source: Foolish talk
ur_pk: بیوقوفانہ گفتگو

source: Obscenity
ur_pk: فحش، بے حیائی

source: Sign, symbol
ur_pk: نشان،علامت

source: Gesture
ur_pk: اشارہ

source: Point at
ur_pk: کسی کی طرف اشارہ کرنا

source: Facial expression
ur_pk: چہرے کے تاثرات

source: Laugh
ur_pk: ہنسنا،ہنسی

source: Cry, tear
ur_pk: رُونا

source: Reading and writing
ur_pk: لکھنا اور پڑھنا

source: Write
ur_pk: لِکھنا

source: Written material
ur_pk: لکھا ہوا مواد

source: Read
ur_pk: پڑھنا

source: Publish
ur_pk: شائع کرنا

source: Record
ur_pk: ریکاڈ

source: List
ur_pk: لِسٹ

source: Letter
ur_pk: خط

source: Interpreting messages
ur_pk: پیغام کی تشریح کرنا

source: Meaning
ur_pk: معنی

source: Meaningless
ur_pk: معنی کے بغیر

source: Unintelligible
ur_pk: غیر ملکی، نا قابل فہم، ناقابل،معقول

source: Show, indicate
ur_pk: دکھانا، ظاہر کرنا

source: Mass communication
ur_pk: مواصلات عامہ

source: Radio, television
ur_pk: ریڈیو اور ٹیلی ویژن

source: Telephone
ur_pk: ٹیلیفون

source: Newspaper
ur_pk: اخبار

source: Movie
ur_pk: فلم

source: Recorded music
ur_pk: ریکارڈ کیا ہوا ساز

source: Communication devices
ur_pk: ابلاغی آلات

source: Teach
ur_pk: پڑھانا

source: Show, explain
ur_pk: دیکھانا، و ضاحت کرنا

source: School
ur_pk: مدرسہ

source: Subject of teaching
ur_pk: مضمون

source: Class, lesson
ur_pk: کلاس، سبق

source: Correct
ur_pk: درست , صحیح

source: Science
ur_pk: سائنس

source: Test
ur_pk: آزمائش

source: Answer in a test
ur_pk: امتحان میں جواب

source: Social behavior
ur_pk: معاشرتی رویہ , چال چلن

source: Relationships
ur_pk: تعلق

source: Friend
ur_pk: دوستی

source: Girlfriend, boyfriend
ur_pk: لڑکی یا لڑکے سے دوستی، یاری

source: Types of people
ur_pk: انسانوں کی اقسام

source: Working relationship
ur_pk: اجتماعی کام

source: Know someone
ur_pk: جان پہچان

source: Meet for the first time
ur_pk: پہلے بار مِلنا

source: Neighbor
ur_pk: پڑوس

source: Social class
ur_pk: معاشرتی نسل

source: Unity
ur_pk: اتفاق/اتحاد

source: Disunity
ur_pk: نااتفاق

source: Unfriendly
ur_pk: غیر دوستانہ

source: Set self apart
ur_pk: اپنے آپ کو علیحدہ رکھنا

source: Alone
ur_pk: اکیلا

source: Independent person
ur_pk: آذاد شخص

source: Private, public
ur_pk: عوام

source: Begin a relationship
ur_pk: رشتہ داری کرنا

source: End a relationship
ur_pk: رشتے کا اختتام

source: Show affection
ur_pk: پیار جتانا

source: Kinship
ur_pk: خونی رشتہ

source: Related by birth
ur_pk: پیداہش کے ذریعے منسلک

source: Grandfather, grandmother
ur_pk: دادا، دادی

source: Father, mother
ur_pk: باپ، ماں

source: Brother, sister
ur_pk: بہن بھائی

source: Son, daughter
ur_pk: بیٹا، بیٹی

source: Grandson, granddaughter
ur_pk: پوتا، پوتی

source: Uncle, aunt
ur_pk: چچا، چچی

source: Cousin
ur_pk: چچا زاد، کزن

source: Nephew, niece
ur_pk: بھتیجا، بھتیجی

source: Birth order
ur_pk: سب سے بڑا،پیدائشی ترتیب

source: Related by marriage
ur_pk: شادی کے ذریعے تعلق

source: Husband, wife
ur_pk: میاں، بیوی

source: In-law
ur_pk: سسرال

source: Widow, widower
ur_pk: بیوہ،رنڈوہ

source: Orphan
ur_pk: یتیم

source: Illegitimate child
ur_pk: حرامی بچہ

source: Adopt
ur_pk: لے پالک

source: Non-relative
ur_pk: غیر رشتہ دار

source: Family, clan
ur_pk: خاندان،قبیلہ

source: Race
ur_pk: نسل

source: Social activity
ur_pk: معاشرتی سرگرمی

source: Invite
ur_pk: دعوت

source: Encounter
ur_pk: آمنا سامنا، مِلنا

source: Meet together
ur_pk: اکھٹے ہونا

source: Visit
ur_pk: سیر

source: Welcome, receive
ur_pk: خوش آمدید، ملنا

source: Show hospitality
ur_pk: مہمان نوازی دِکھانا

source: Meeting, assembly
ur_pk: اجتماع، مجلس، انجمن

source: Participate
ur_pk: شرکت

source: Crowd, group
ur_pk: ہجوم، جماعت

source: Organization
ur_pk: تنظیم

source: Join an organization
ur_pk: کسی تنظیم میں شامل ہونا

source: Leave an organization
ur_pk: تنظیم کو چھوڑنا

source: Belong to an organization
ur_pk: کسی تنظیم سے تعلق رکھنا

source: Social group
ur_pk: معاشرتی گروہ

source: Social event
ur_pk: معاشرتی سرگرمی

source: Ceremony
ur_pk: تقریب

source: Festival, show
ur_pk: تہوار، جشن

source: Celebrate
ur_pk: تہوار

source: Music
ur_pk: موسیقی

source: Compose music
ur_pk: موسیقی کا تخلیق کرنا/ نغمہ سازی

source: Play music
ur_pk: موسیقی گانا

source: Sing
ur_pk: گانا

source: Musician
ur_pk: موسیقار

source: Musical instrument
ur_pk: موسیقی کے آلات

source: Dance
ur_pk: ناچ

source: Drama
ur_pk: ڈرامہ

source: Entertainment, recreation
ur_pk: تفریح

source: Game
ur_pk: کھیل/ کرتب

source: Card game
ur_pk: تاش وغیرہ کے پتوں کا کھیل

source: Chess
ur_pk: شطرنج

source: Sports
ur_pk: کھیل

source: Football, soccer
ur_pk: فٹ بال

source: Basketball
ur_pk: باسکٹ بال

source: Exercise
ur_pk: ورزش

source: Gambling
ur_pk: قمار بارزی

source: Play, fun
ur_pk: کھیلنا، فن

source: Humor
ur_pk: خوش مزاجی/ شگفتگی

source: Serious
ur_pk: سنجیدہ

source: Holiday
ur_pk: چھٹی

source: Free time
ur_pk: فارغ وقت

source: Behavior
ur_pk: چال ڈھال،چال چلن

source: Good, moral
ur_pk: اچھا/ اخلاقی

source: Bad, immoral
ur_pk: برا، بد اخلاق

source: Meet a standard
ur_pk: معیار حاصل کرنا

source: Below standard
ur_pk: نچلے درجے کا

source: Mature in behavior
ur_pk: رویے میں پُختہ

source: Immature in behavior
ur_pk: رویے میں ناپُختہ

source: Sensible
ur_pk: معقولیت پسند/ متوازن

source: Reputation
ur_pk: شُہرت

source: Patient
ur_pk: رحم دِل، صابر

source: Impatient
ur_pk: جلد باز

source: Bad-tempered
ur_pk: بد مزاج/ برہم

source: Admire someone
ur_pk: کسی کی تعریف کرنا

source: Despise someone
ur_pk: کسی سے حقارت کرنا

source: Humble
ur_pk: ملنسار/ عاجز

source: Proud
ur_pk: مغرور

source: Show off
ur_pk: اپنے آپ کو دکھانا

source: Love
ur_pk: محبت

source: Hate, ill will
ur_pk: نفرت/ بری خواہش

source: Not care
ur_pk: دیکھ بھال نہ کرنا

source: Abandon
ur_pk: ترک کرنا،طلاق دینا، چھوڑنا

source: Do good to
ur_pk: پیار کرنا، رحم دِل ہونا

source: Do evil to
ur_pk: بُرا پیش آنا

source: Help
ur_pk: مدد

source: Hinder
ur_pk: منع کرنا/ مزاحمت کرنا

source: Cooperate with
ur_pk: تعاون کرنا

source: Compete with
ur_pk: ہمسری کرنا، برابری کرنا

source: Altruistic, selfless
ur_pk: بے غرض، دوسروں کا خیال رکھنے والا

source: Selfish
ur_pk: خود غرض

source: Use a person
ur_pk: کسی شخص کو استعمال کرنا

source: Share with
ur_pk: شامل ہونا، شریک کرنا

source: Provide for, support
ur_pk: مہیا کرنا، سپورٹ کرنا

source: Care for
ur_pk: حفاظت کرنا، کسی کی ضرورت پورا کرنا
